[
  {
    "id": "2510.11126v1",
    "title": "In-plane polar domains enhanced energy storage",
    "abstract": "Relaxor ferroelectric thin films are recognized for their ultrahigh power\ndensity, rendering them highly promising for energy storage applications in\nelectrical and electronic systems. However, achieving high energy storage\nperformance with chemically homogeneous, environmentally friendly and\ncompositionally stable materials remains challenging. In this work, we present\na design of dielectrics with high energy storage performance via an in-plane\npolar domains incorporating polar nanoregions mechanism. Guided by phase-field\nsimulations, we synthesized La/Si co-doping BaTiO3 solid-solution thin films\nwith high chemical homogeneity to realize high energy storage performance.\nGiven that, we achieve a high energy density of 203.7J/cm3 and an energy\nefficiency of approximately 80% at an electric field of 6.15MV/cm. This\nmechanism holds significant promise for the design of next-generation\nhigh-performance dielectric materials for energy storage and other advanced\nfunctional materials.",
    "authors": [
      "Yu Lei",
      "Xiaoming Shi",
      "Sihan Yan",
      "Qinghua Zhang",
      "Jiecheng Liu",
      "Sixu Wang",
      "Yu Chen",
      "Jiaou Wang",
      "He Qi",
      "Qian Li",
      "Ting Lin",
      "Jingfen Li",
      "Qing Zhu",
      "Haoyu Wang",
      "Jing Chen",
      "Lincong Shu",
      "Linkun Wang",
      "Han Wu",
      "Xianran Xing"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.11126v1",
    "entry_id": "http://arxiv.org/abs/2510.11126v1",
    "published": "2025-10-13T08:15:31+00:00",
    "updated": "2025-10-13T08:15:31+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11126v1.pdf"
  },
  {
    "id": "2510.12530v1",
    "title": "Origin of Enhanced Thermal Resistance Near Nanoscale Hotspots: Insights from Full-Dispersion-Resolved Phonon Transport in Silicon",
    "abstract": "Phonon transport near nanoscale hotspots (NHs) critically determines heat\ndissipation in advanced electronic devices. The prevailing understanding is\nthat the enhanced thermal resistance (TR) observed in NHs originates from long\nmean free path (MFP) phonons, whose MFPs are much larger than the hotspot size,\nthereby limiting their ability to recognize hotspots and transport heat\neffectively. In this study, we revisit this problem by employing the Boltzmann\ntransport equation (BTE) with a full phonon dispersion model (FPDM) to capture\nmode-resolved velocities, scattering processes, and nonequilibrium phonon\npopulations in silicon. The analysis demonstrates that the increase in TR near\nNHs is not caused by the long MFP itself but by the low specific heat of\nlong-MFP phonons that do not scatter directly with optical modes. These phonons\nheat readily when energy is supplied, steepening the local temperature gradient\nnear the NH and thereby enhancing TR. By resolving the spectral contributions\nto the phonon transport resistance and temperature gradients, we identify the\ncritical role of the modal specific heat in nonlocal phonon transport. These\nresults provide new physical insights into nanoscale thermal management and\nhighlight the importance of spectral mode resolution in modeling heat\ndissipation in electronic devices.",
    "authors": [
      "Jae Sik Jin"
    ],
    "categories": [
      "cond-mat.mes-hall"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.12530v1",
    "entry_id": "http://arxiv.org/abs/2510.12530v1",
    "published": "2025-10-14T13:56:10+00:00",
    "updated": "2025-10-14T13:56:10+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12530v1.pdf"
  },
  {
    "id": "2510.09961v1",
    "title": "Real-time dynamics with bead-Fourier path integrals. II. Bead-Fourier RPMD",
    "abstract": "Feynman path integrals (PIs) have found many uses in approximate quantum\ndynamics methods that are able to efficiently calculate real-time quantum\ncorrelation functions. The PIs typically take the form of discrete imaginary\ntime slices over a closed path, where the slices form the ``beads'' of a ring\npolymer (RP) necklace. Some methods, such as centroid molecular dynamics (CMD),\nuse the RP to generate an effective potential for the dynamics, while others,\nlike RP molecular dynamics (RPMD), directly utilize the RP in real-time\ndynamics in order to incorporate quantum effects. The standard, discretized\nbead forms of CMD and RPMD can require a large number of RP beads to provide\naccurate results for systems where quantum effects are strong, such as at low\ntemperatures. In Paper I, we introduced the bead-Fourier (BF) CMD method, where\nwe utilized the inclusion of a Fourier sine series to reduce the number of\nbeads needed to converge the CMD effective potential up to eightfold. In this\nwork, we extend RPMD to incorporate BF-PIs in the form of BF-RPMD. We study a\nnumber of different implementations of the method through the calculation of\ncorrelation functions for both linear and non-linear operators. The\neffectiveness of the BF-RPMD method is sensitive to both the system and form of\nthe operators being studied, but we show that this method is able to produce\nresults on par with standard RPMD, with at worst twofold and up to eightfold\nreduction in the number of beads by including two to three Fourier components.",
    "authors": [
      "Nathan London",
      "Mohammad R. Momeni"
    ],
    "categories": [
      "physics.chem-ph",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.chem-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.09961v1",
    "entry_id": "http://arxiv.org/abs/2510.09961v1",
    "published": "2025-10-11T02:17:45+00:00",
    "updated": "2025-10-11T02:17:45+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.09961v1.pdf"
  },
  {
    "id": "2510.11945v1",
    "title": "Orbitally-Resolved Mechanical Properties of Solids from Maximally Localized Wannier Functions",
    "abstract": "We present a technique for partitioning the total energy from a semi-local\ndensity functional theory calculation into contributions from individual\nelectronic states in a localized Wannier basis. We use our technique to reveal\nthe key role played by the $s$ and $p$ orbitals of the apical oxygen atoms in a\ncurious elastic anomaly exhibited by ferroelectric PbTiO$_3$ under applied\nstress, which has so far gone unexplained. Our technique enables new insights\ninto the chemical origins of the mechanical properties of materials, or any\nproperty given by an energy derivative.",
    "authors": [
      "Ethan T. Ritz",
      "Guru Khalsa",
      "Hsin-Yu Ko",
      "Ju-an Zhang",
      "Robert A. DiStasio Jr.",
      "Nicole A. Benedek"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.11945v1",
    "entry_id": "http://arxiv.org/abs/2510.11945v1",
    "published": "2025-10-13T21:09:52+00:00",
    "updated": "2025-10-13T21:09:52+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11945v1.pdf"
  },
  {
    "id": "2510.12006v1",
    "title": "Evidence for easy-plane XY ferromagnetism in heavy-fermion quantum-critical CeRh6Ge4",
    "abstract": "We report $^{73}$Ge nuclear quadrupole resonance (NQR) and magnetic resonance\n(NMR) spectroscopy in the heavy-fermion quantum-critical ferromagnet\nCeRh$_6$Ge$_4$. NQR and NMR spectral measurements at the two non-equivalent Ge\nsites reveal electric field gradient tensors and the directions of their\nprincipal axes relative to the hexagonal basal plane. The spin-lattice\nrelaxation rate $1/T_1$ experiments reveal a clear critical slowing down\napproaching the ferromagnetic transition. $1/T_1$ in the paramagnetic state is\nfound to be predominantly caused by fluctuating 4$f$-local moments. The Knight\nshift shows Curie-Weiss behavior at high temperature and a deviation from this\nbelow $T^\\ast$ $\\approx$ 25 K possibly due to a mixture of crystalline electric\nfield effects and Kondo screening. Order-parameter-like behavior of hyperfine\nfields at the Ge sites and ferromagnetic signal enhancement are observed in\nZeeman-perturbed NQR, with uniform ferromagnetic order and a small ordered\nmoment of $\\approx$ 0.26 $\\mu_B$/Ce confined within the $ab$-plane. The ordered\nmoment shows a notable in-plane magnetic stiffness against out-of-plane\nradiofrequency fields and has an (XY-type) in-plane isotropic nature. Our\nresults reveal a strong easy-plane anisotropy of 4$f$-electron moment and\nsuggest an involved interplay of hybridization and local moment physics in this\nquantum critical heavy-fermion ferromagnet.",
    "authors": [
      "Riku Yamamoto",
      "Sejun Park",
      "Zachary W. Riedel",
      "Phurba Sherpa",
      "Joe D. Thompson",
      "Filip Ronning",
      "Eric D. Bauer",
      "Adam P. Dioguardi",
      "Michihiro Hirata"
    ],
    "categories": [
      "cond-mat.str-el"
    ],
    "primary_category": "cond-mat.str-el",
    "pdf_url": "http://arxiv.org/pdf/2510.12006v1",
    "entry_id": "http://arxiv.org/abs/2510.12006v1",
    "published": "2025-10-13T22:58:44+00:00",
    "updated": "2025-10-13T22:58:44+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12006v1.pdf"
  },
  {
    "id": "2510.12746v1",
    "title": "Oxygen-vacancy-induced Raman softening in the catalyst Fe$_2$(MoO$_4$)$_3$",
    "abstract": "Although iron molybdate (Fe$_2$(MoO$_4$)$_3$) has been commercially utilized\nfor the production of formaldehyde from methanol via oxidative dehydrogenation,\nthe detailed mechanism during the catalytic process remains unclear. Recent\noperando Raman and impedance measurements of the reaction suggested that the\nbulk region of Fe$_2$(MoO$_4$)$_3$ acts as a reservoir of oxygen atoms that can\nmigrate to the surface to participate in catalysis. This conclusion was drawn\nfrom the observed significant reduction in Raman intensity during the catalytic\nprocess which implies the formation of atomic defects. However, the microscopic\norigin of this reduction remains to be clarified. In this work, we performed\ndensity functional theory (DFT) calculations to elucidate the origin of the\nexperimentally observed Raman intensity variation. Our phonon analysis reveals\nthat oxygen-dominated vibrational modes, with a small Mo contribution, occur\nnear 782 cm$^{-1}$-the same frequency region where the Raman intensity\nreduction was measured. Using an effective frozen-phonon approach, we further\ndemonstrate that oxygen vibrations are primarily responsible for the decrease\nin calculated Raman intensity. Moreover, structural relaxation of\nFe$_2$(MoO$_4$)$_3$ including an oxygen vacancy suggests that oxygen diffusion\nfrom the bulk to the surface should occur without significant alteration of the\nlocal symmetry, consistent with the absence of measurable peak shifts or\nbroadening in the experimental Raman spectra.",
    "authors": [
      "Young-Joon Song",
      "Roser Valentí"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.12746v1",
    "entry_id": "http://arxiv.org/abs/2510.12746v1",
    "published": "2025-10-14T17:25:24+00:00",
    "updated": "2025-10-14T17:25:24+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12746v1.pdf"
  },
  {
    "id": "2510.11678v1",
    "title": "Spinon Mediation of Witness-Spin Dynamics and Ground State in Herbertsmithite",
    "abstract": "The kagome lattice of spin-1/2 Cu atoms in herbertsmithite (ZnCu3(OH)6Cl2)\nmay sustain a quantum spin liquid (QSL) state with spinon quasiparticles. Each\nkagome plane is separated from its homologues by a layer of spinless Zn atoms.\nProvidentially, however, some spin-1/2 Cu atoms substitute randomly onto these\ninter-kagome Zn sites. We reconceptualize these 'impurity' atoms as quantum\n'witness-spins', an exceptional new interrogative of the conjectured\nZ2-gauge-symmetric QSL state. Thus we introduce spin-noise spectroscopy to\nexplore herbertsmithite witness-spin dynamics for QSL studies. It reveals the\nexistence, slowing and intensification of spin noise, prefatory to a sharp\ntransition at T* {\\approx} 260 mK. Below T* the spin-noise power spectral\ndensity S_M({\\omega},T) {\\propto} {\\omega}^{-{\\alpha}(T)} stabilizes at\n{\\alpha} {\\approx} 1; the spin noise variance {\\sigma}_M^2(T) diminishes\nprecipitously; the ultra-low-field magnetic susceptibility {\\chi}(T) undergoes\na sharp transition into a phase exhibiting an Edwards-Anderson order-parameter\nand ultra-slow spin-state relaxation. A Z2 QSL theory of spinon-mediated\nwitness-spin interactions corresponds best to all these experimental\nobservations, predicting slowing and intensification of witness-spin\nfluctuations and noise spectrum S_M({\\omega},T) with cooling, with a transition\ninto a unique spinon-mediated phase signified by rapidly diminishing spin\nnoise, with S_M({\\omega},T) {\\propto} {\\omega}^{-1}, a sharp cusp in the DC\nmagnetic susceptibility {\\chi}(T), and the appearance of an Edwards-Anderson\norder-parameter. We rule out numerous other mechanisms for these effects, so\nthat only spinon-mediation by either a Z2 or U(1) QSL is consistent with all\npresent herbertsmithite empirics, with the former model providing a closer\nmatch to data.",
    "authors": [
      "Hiroto Takahashi",
      "Jack Murphy",
      "Mitikorn Wood-Thanan",
      "Pascal Puphal",
      "Miguel Angel Sanchez-Martinez",
      "Fabian Jerzembeck",
      "Chun-Chih Hsu",
      "Jonathan Ward",
      "Masahiko Isobe",
      "Yosuke Matsumoto",
      "Hidenori Takagi",
      "Stephen J. Blundell",
      "Michael R. Norman",
      "Felix Flicker",
      "J. C. Séamus Davis"
    ],
    "categories": [
      "cond-mat.str-el",
      "cond-mat.other"
    ],
    "primary_category": "cond-mat.str-el",
    "pdf_url": "http://arxiv.org/pdf/2510.11678v1",
    "entry_id": "http://arxiv.org/abs/2510.11678v1",
    "published": "2025-10-13T17:46:03+00:00",
    "updated": "2025-10-13T17:46:03+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11678v1.pdf"
  },
  {
    "id": "2510.11820v1",
    "title": "Universal scaling of shear thickening suspensions under acoustic perturbation",
    "abstract": "Tuning shear thickening behavior is a longstanding problem in the field of\ndense suspensions. Acoustic perturbations offer a convenient way to control\nshear thickening in real time, opening the door to a new class of smart\nmaterials. However, complete control over shear thickening requires a\nquantitative description for how suspension viscosity varies under acoustic\nperturbation. Here, we achieve this goal by experimentally probing suspensions\nwith acoustic perturbations and incorporating their effect on the suspension\nviscosity into a universal scaling framework where the viscosity is described\nby a scaling function, which captures a crossover from the frictionless jamming\ncritical point to a frictional shear jamming critical point. Our analysis\nreveals that the effect of acoustic perturbations may be explained by the\nintroduction of an effective interparticle repulsion whose magnitude is roughly\nequal to the acoustic energy density. Furthermore, we demonstrate how this\nscaling framework may be leveraged to produce explicit predictions for the\nviscosity of a dense suspension under acoustic perturbation. Our results\ndemonstrate the utility of the scaling framework for experimentally\nmanipulating shear thickening systems.",
    "authors": [
      "Anna R. Barth",
      "Navneet Singh",
      "Stephen J. Thornton",
      "Pranav Kakhandiki",
      "Edward Y. X. Ong",
      "Meera Ramaswamy",
      "Abhishek M. Shetty",
      "Bulbul Chakraborty",
      "James P. Sethna",
      "Itai Cohen"
    ],
    "categories": [
      "cond-mat.soft"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.11820v1",
    "entry_id": "http://arxiv.org/abs/2510.11820v1",
    "published": "2025-10-13T18:16:22+00:00",
    "updated": "2025-10-13T18:16:22+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11820v1.pdf"
  },
  {
    "id": "2510.10589v1",
    "title": "RKKY interaction in Weyl semimetal nanowires",
    "abstract": "We investigate the effective couplings induced between localized impurities\non the surface of a Weyl semimetal (WSM) nanowire within the framework of\nRuderman--Kittel--Kasuya--Yosida (RKKY) theory. The itinerant electrons from\nthe chiral Fermi arc surface states mediate impurity-impurity interaction at\nlow energies. As a result, the spin-momentum locking naturally plays a central\nrole in shaping the spin-spin correlations. We show that the dominant\ninteraction channels have distinct origins: while the azimuthal coupling,\n$J_{\\phi\\phi}$ term arises exclusively from Fermi arc states with identical\nspin polarization, the couplings $J_{\\mu\\nu}$ ($\\mu,\\nu = z,r$) are governed by\nFermi arc states with opposite spin polarizations. Furthermore, we demonstrate\nthat purely surface-mediated contributions exhibit different scaling behavior\ncompared to those involving Fermi arcs and low-energy bulk states. We\nsystematically untangle the contributions from bulk and surface states to the\nRKKY couplings, using analytical and numerical methods. Our results establish\nWSM nanowires as a versatile platform for engineering and simulating a broad\nclass of spin models.",
    "authors": [
      "Rohit Mukherjee",
      "Asutosh Dubey"
    ],
    "categories": [
      "cond-mat.mes-hall"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.10589v1",
    "entry_id": "http://arxiv.org/abs/2510.10589v1",
    "published": "2025-10-12T13:12:05+00:00",
    "updated": "2025-10-12T13:12:05+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10589v1.pdf"
  },
  {
    "id": "2510.10230v1",
    "title": "Scaling of Magnetic Domain Walls in Perpendicular Magnetic Anisotropy Systems",
    "abstract": "Magnetic domain walls play a critical role in the nanoscale evolution of\nmagnetic devices. Despite the early efforts, a complete understanding of the\nmicromagnetic evolution of the width and the type of magnetic domain walls has\nstill remained missing. Here, we report a combined analytical and micromagnetic\nsimulation study and establish the scaling of the magnetic domains as a\nfunction of the exchange stiffness (A), uniaxial perpendicular magnetic\nanisotropy (Ku), saturation magnetization (Ms), and Dzyaloshinskii-Moriya\ninteraction (DMI), and shape anisotropy of the magnetic device. We find that\nthe width of both Bloch and Neel walls scales excellently with the analytical\nprediction. The DMI is found to have little influence on the domain wall width\nbut strongly affect the type of the domain wall. The domain wall has a Bloch\nconfiguration at zero DMI and gradually transitions to Neel configuration upon\nincrease of the DMI. The shape anisotropy of the magnetic domain wall also\naffects the domain wall width. These results have established a comprehensive,\nconclusive understanding of the magnetic domain walls within spintronics\ndevices.",
    "authors": [
      "Guowen Gong",
      "Changmin Xiong",
      "Lijun Zhu"
    ],
    "categories": [
      "cond-mat.mes-hall"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.10230v1",
    "entry_id": "http://arxiv.org/abs/2510.10230v1",
    "published": "2025-10-11T14:08:59+00:00",
    "updated": "2025-10-11T14:08:59+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10230v1.pdf"
  },
  {
    "id": "2510.10817v1",
    "title": "On the discovery of meteoritic mineral Zolenskyite; The artificial origin should not be overlooked",
    "abstract": "Recently a new meteoritic mineral, Zolenskyite\n(Fe0.99Mn0.04Ca0.01Cr1.99S3.98), was discovered from the Indarch meteorite.\nZolenskyite was structurally indexed as the monoclinic C2/m CrNb2Se4 - Cr3S4\ntype structure of synthetic FeCr2S4, with unit cell parameters a = 12.84(1)\n{\\AA}, b = 3.44(1) {\\AA}, c = 5.94(1) {\\AA} and \\b{eta} = 117(1){\\deg}.\nZolenskyite was reported as high-pressure phase formed from Daubr\\'eelite at\nhigh pressures and temperatures in highly shocked regions of the EH parent\nasteroid. Although this discovery provides valuable information about the\norigin of meteoritic mineral assemblages, the results and conclusions raise\ncontroversies with those reported in previous articles where the synthetic\nFeCr2S4 was described. In this review, an alternative analysis of the\nsupplementary X-ray data from Zolenskyite was made and yields to the monoclinic\nI2/m Cr3S4 type structure of synthetic FeCr2S4, with unit cell parameters a =\n5.940 {\\AA}, b = 3.440 {\\AA}, c = 11.441 {\\AA} and \\b{eta} = 90.55{\\deg}, in\nagreement with previous results in the literature and differ from those\nreported above. Regarding the genesis of Zolenskyite and according to\nsolid-state laboratory synthesis, the transformation of cubic FeCr2S4 phase\n(ideal composition of Daubr\\'eelite) to monoclinic FeCr2S4 (ideal composition\nof Zolenskyite) requires a process whose replication in Shock metamorphism\nstages is not well established and remains an open issue to address, together\nwith another open issue related to the real composition of meteoritic minerals,\nwith minor and trace metals, which is often overlooked when compared with\nsynthetic ideal compositions. Whatever the results to be obtained by addressing\nthe above open issues, they will shed more light on the genesis of Zolenskyite.\nIn this context, it is worth to promote an open debate about the hypothesis of\nartificial origin.",
    "authors": [
      "Boutros Pierre Embaid"
    ],
    "categories": [
      "astro-ph.EP",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "astro-ph.EP",
    "pdf_url": "http://arxiv.org/pdf/2510.10817v1",
    "entry_id": "http://arxiv.org/abs/2510.10817v1",
    "published": "2025-10-12T21:51:57+00:00",
    "updated": "2025-10-12T21:51:57+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10817v1.pdf"
  },
  {
    "id": "2510.10255v1",
    "title": "Localization Transition on Random Graphs with Chiral and Bogoliubov-de Gennes Symmetry Classes",
    "abstract": "We studied single-particle Anderson localization in ensembles of graphs that\ncorrespond to chiral and Bogoliubov-de Gennes (BdG) symmetry classes. For a\nrandom biregular bipartite graph with chiral symmetry, the density of states\nwas found using the cavity approach. Calculating the fractal dimension shows\nthe effects of disordered zero modes. For Bogoliubov-de Gennes ensembles with\nan underlying random regular graph (RRG), the density of states was calculated\nboth numerically and analytically. The ensembles BdG-RRG with\nsymmetry-conserving diagonal disorder in the delocalized phase have a smaller\nfractal dimension compared to the usual RRG.",
    "authors": [
      "Daniil Kochergin"
    ],
    "categories": [
      "cond-mat.dis-nn"
    ],
    "primary_category": "cond-mat.dis-nn",
    "pdf_url": "http://arxiv.org/pdf/2510.10255v1",
    "entry_id": "http://arxiv.org/abs/2510.10255v1",
    "published": "2025-10-11T15:23:33+00:00",
    "updated": "2025-10-11T15:23:33+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10255v1.pdf"
  },
  {
    "id": "2510.09890v1",
    "title": "Polymer Topology and the Depletion Interaction",
    "abstract": "Using a theoretical model we show that ideal ring polymers are stronger\ndepletants than ideal linear polymers of equal radii of gyration, but not of\nequal hydrodynamic radii. The difference in the depletion-induced force profile\nis largely controlled by the thickness of the depletion layer. Theory suggests\nthat this thickness is equal to the average extent of a polymer along the\ndirection perpendicular to the surfaces of the colloids. Within the limits of\nfinite-size effects, Molecular Dynamics simulations support this conclusion.",
    "authors": [
      "Mauro L. Mugnai"
    ],
    "categories": [
      "cond-mat.soft"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.09890v1",
    "entry_id": "http://arxiv.org/abs/2510.09890v1",
    "published": "2025-10-10T22:12:09+00:00",
    "updated": "2025-10-10T22:12:09+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.09890v1.pdf"
  },
  {
    "id": "2510.12074v1",
    "title": "Metalorganic Chemical Vapor Deposition of AlScN Thin Films and AlScN/AlN/GaN Heterostructures",
    "abstract": "AlScN thin films were grown via metalorganic chemical vapor deposition\n(MOCVD), showing controllable incorporation of scandium (Sc) into the AlN\nlattices. Systematic variation of growth parameters demonstrated an obvious\ninfluence on Sc incorporation, with X-ray photoelectron spectroscopy (XPS)\nanalysis indicating Sc composition up to $\\sim$13\\% when (MCp)$_2$ScCl was used\nas the precursor. AlScN/AlN/GaN heterostructures grown on GaN templates\nexhibited the formation of a two-dimensional electron gas (2DEG) channel at the\nAlScN/AlN--GaN interface, confirming their potential use in high electron\nmobility transistor (HEMT) device technologies. Variation in AlScN/AlN barrier\nthickness within the heterostructures showed that thicker barriers yield higher\nsheet charge densities from both Hall and capacitance-voltage (C--V)\nmeasurements. With an AlScN/AlN barrier thickness of $\\sim$30~nm, a sheet\ncharge density of $5.22\\times10^{12}$~cm$^{-2}$ was extracted from C--V.\nHigh-resolution scanning transmission electron microscopy (S/TEM) further\nconfirmed Sc incorporation and revealed the wurtzite crystalline structure of\nthe films and heterostructures. These results establish MOCVD growth of AlScN\nas a promising and compatible material for advancing III-nitride\nheterostructures in high-performance electronics and potentially\nferroelectrics.",
    "authors": [
      "Vijay Gopal Thirupakuzi Vangipuram",
      "Abdul Mukit",
      "Kaitian Zhang",
      "Salva Salmani-Rezaie",
      "Hongping Zhao"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.app-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.12074v1",
    "entry_id": "http://arxiv.org/abs/2510.12074v1",
    "published": "2025-10-14T02:29:38+00:00",
    "updated": "2025-10-14T02:29:38+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12074v1.pdf"
  },
  {
    "id": "2510.11906v1",
    "title": "Modelling of magnetic vortex microdisc dynamics under varying magnetic field in biological viscoelastic environments",
    "abstract": "Magnetically driven microparticles provide a versatile platform for probing\nand manipulating biological systems, yet the physical framework governing their\nactuation in complex environments remains only partially explored. Within the\nfield of cellular magneto-mechanical stimulation, vortex microdiscs have\nemerged as particularly promising candidates for developing novel therapeutic\napproaches. Here, we introduce a simplified two-dimensional model describing\nthe magneto-mechanical response of such particles embedded in viscoelastic\nmedia under varying magnetic fields. Using a Maxwell description of the medium\ncombined with simplified elasticity assumptions, we derive analytical\nexpressions and support them with numerical simulations of particle motion\nunder both oscillating and rotating magnetic fields. Our results show that\nrotating fields typically induce oscillatory dynamics and that the transition\nto asynchronous motion occurs at a critical frequency determined by viscosity\nand stiffness. The amplitude and phase of this motion is governed by the\ncompetition between magnetic and viscoelastic contributions, with particle\nmotion being strongly impaired when the latter dominate. Energy-based\nconsiderations further demonstrate that, within the frequency range explored of\nfew tens of Hertz, no heat is generated -- distinguishing this approach from\nmagnetic hyperthermia -- while the elastic energy transferred to the\nsurrounding medium is, in principle, sufficient to perturb major cellular\nprocesses. This work provides a simple framework to anticipate the first-order\ninfluence of rheological properties on magnetically driven microdisc dynamics,\nthereby enabling a better understanding of their impact in cells or\nextracellular materials and bridging the gap between experimental observations\nand theoretical modelling.",
    "authors": [
      "Andrea Visonà",
      "Robert Morel",
      "Hélène Joisten",
      "Bernard Dieny",
      "Alice Nicolas"
    ],
    "categories": [
      "cond-mat.soft",
      "physics.bio-ph"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.11906v1",
    "entry_id": "http://arxiv.org/abs/2510.11906v1",
    "published": "2025-10-13T20:15:17+00:00",
    "updated": "2025-10-13T20:15:17+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11906v1.pdf"
  },
  {
    "id": "2510.11929v1",
    "title": "Bond-resolved STM with density-based methods",
    "abstract": "Bond-resolved STM (BRSTM) is a recent technique that combines the advantages\nof scanning tunneling microscopy (STM) with the outstanding intramolecular\nresolution provided by non-contact atomic force microscopy (ncAFM) using a\nCO-functionalized tips, offering unique insights into molecular interactions at\nsurfaces. In this work, we present a novel and easily implementable approach\nfor simulating BRSTM images, which we have applied to reproduce new\nexperimental BRSTM data of Perylene-3,4,9,10-tetracarboxylic dianhydride\n(PTCDA) on Ag(111), obtained with unprecedented control of tip-sample\nseparation ($\\sim$10~pm). Our method integrates the Full-Density-Based Model\n(FDBM) developed for High-Resolution Atomic Force Microscopy (HRAFM) with\nChen's derivative approximation for tunneling channels, effectively capturing\nthe contributions of both $\\sigma$ and $\\pi$ channels, while accounting for the\nCO-tip deflection induced by probe-sample interactions. This approach\naccurately reproduces the experimental results for both PTCDA/Ag(111) and\n1,5,9-trioxo-13-azatriangulene (TOAT)/Cu(111) systems, including intricate\ntip-sample distance-dependent features. Furthermore, we also demonstrate the\nimportant role of substrate-induced effects, which can modify molecular orbital\noccupation and the relaxation of the CO probe, resulting in distinct BRSTM\nimage characteristics.",
    "authors": [
      "Emiliano Ventura-Macias",
      "Jose Martinez-Castro",
      "Guillermo Haas",
      "Jara Trujillo-Mulero",
      "Pablo Pou",
      "Taner Esat",
      "Markus Ternes",
      "Ruslan Temirov",
      "F. Stefan Tautz",
      "Ruben Perez"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.ins-det"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.11929v1",
    "entry_id": "http://arxiv.org/abs/2510.11929v1",
    "published": "2025-10-13T20:50:32+00:00",
    "updated": "2025-10-13T20:50:32+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11929v1.pdf"
  },
  {
    "id": "2510.11459v1",
    "title": "Efficient and accurate tensor network algorithm for Anderson impurity problems",
    "abstract": "The Anderson impurity model (AIM) is of fundamental importance in condensed\nmatter physics to study strongly correlated effects. However, accurately\nsolving its long-time dynamics still remains a great numerical challenge. An\nemergent and rapidly developing numerical strategy to solve the AIM is to\nrepresent the Feynman-Vernon influence functional (IF), which encodes all the\nbath effects on the impurity dynamics, as a matrix product state (MPS) in the\ntemporal domain. The computational cost of this strategy is basically\ndetermined by the bond dimension $\\chi$ of the temporal MPS. In this work, we\npropose an efficient and accurate method which, when the hybridization function\nin the IF can be approximated as the summation of $n$ exponential functions,\ncan systematically build the IF as a MPS by multiplying $O(n)$ small MPSs, each\nwith bond dimension $2$. Our method gives a worst case scaling of $\\chi$ as\n$2^{8n}$ and $2^{2n}$ for real- and imaginary-time evolution respectively. We\ndemonstrate the performance of our method for two commonly used bath spectral\nfunctions, where we show that the actually required $\\chi$s are much smaller\nthan the worst case.",
    "authors": [
      "Zhijie Sun",
      "Zhenyu Li",
      "Chu Guo"
    ],
    "categories": [
      "cond-mat.str-el",
      "quant-ph"
    ],
    "primary_category": "cond-mat.str-el",
    "pdf_url": "http://arxiv.org/pdf/2510.11459v1",
    "entry_id": "http://arxiv.org/abs/2510.11459v1",
    "published": "2025-10-13T14:30:03+00:00",
    "updated": "2025-10-13T14:30:03+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11459v1.pdf"
  },
  {
    "id": "2510.09998v1",
    "title": "Ambient-Stable Transfer-Free Graphdiyne Wafers with Superhigh Hole Mobility at Room Temperature",
    "abstract": "Graphdiyne (GDY) is recognized as a compelling candidate for the fabrication\nof next-generation high-speed low-energy electronic devices due to its inherent\np-type semiconductor characteristics. However, the development of GDY for\napplications in field-effect transistors (FETs), complementary\nmetal-oxide-semiconductor (CMOS), and logic devices remains constrained by the\nrelatively low carrier mobility reported in current experimental studies.\nHerein, the synthesis of layer-controlled hydrogen-substituted graphdiyne\n(HsGDY) films directly on silicon substrates under a supercritical CO2\natmosphere is reported, along with the fabrication of these films into\nHsGDY-based FETs. The transfer-free growth strategy eliminates performance\ndegradation caused by post-synthesis transfer processes. The resulting HsGDY\nFETs exhibit a remarkable hole mobility of up to 3800 cm2 V-1 s-1 at\nroom-temperature, which is an order of magnitude higher than that of most\np-type semiconductors. The synthesis of transfer-free HsGDY wafers provides a\nnew strategy for resolving the carrier mobility mismatch between p-channel and\nn-channel two-dimensional metal-oxide-semiconductor devices.",
    "authors": [
      "Beining Ma",
      "Jianyuan Qi",
      "Xinghai Shen"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.chem-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.09998v1",
    "entry_id": "http://arxiv.org/abs/2510.09998v1",
    "published": "2025-10-11T03:50:46+00:00",
    "updated": "2025-10-11T03:50:46+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.09998v1.pdf"
  },
  {
    "id": "2510.12602v1",
    "title": "The spin Hall conductivity in the hole-doped bilayer Haldane-Hubbard model with odd-parity ALM",
    "abstract": "Spin current generated electrically is among the core phenomena of\nspintronics for driving high-performance spin device applications. Here, on the\nbasis of systematic investigations for the hole doped single-layer\nHaldane-Hubbard(HH) model, we propose a new bilayer HH model to realize the\ncompensated odd-parity spin splitting and the $T$-even spin Hall conductivity\nwhere the two layers are connected by the time reversal transformation. Our\nresults show that the vanishing layer-dependent electric potential $V_{L}$\ngives rise to odd-parity ALM protected by the combined symmetry $TM_{xy}$ with\n$T$ and $M_{xy}$ being the time reversal and mirror reflection perpendicular to\n$z$ axis, and the $T$-even spin Hall conductivity simultaneously. In addition,\nthough the staggered magnetization within each layer is substantially impacted\nby the layer-dependent electric potential, small $V_{L}$'s only bring\nnegligible changes to the net magnetization and the spin Hall conductivity,\nindicating that the alternating spin splitting in momentum space and the spin\nHall conductivity are insusceptible to external elements. Most importantly, our\nwork provides a general framework for the simultaneous realization of the\ncompensated odd-parity spin splitting in momentum space and the spin Hall\nconductivity in collinear magnets, in terms of stacked multi-layer systems.",
    "authors": [
      "Minghuan Zeng",
      "Ling Qin",
      "Shiping Feng",
      "Dong-Hui Xu",
      "Rui Wang"
    ],
    "categories": [
      "cond-mat.str-el"
    ],
    "primary_category": "cond-mat.str-el",
    "pdf_url": "http://arxiv.org/pdf/2510.12602v1",
    "entry_id": "http://arxiv.org/abs/2510.12602v1",
    "published": "2025-10-14T14:57:09+00:00",
    "updated": "2025-10-14T14:57:09+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12602v1.pdf"
  },
  {
    "id": "2510.12344v1",
    "title": "Two-Dimensional Altermagnetism in Epitaxial CrSb Ultrathin Films",
    "abstract": "Altermagnets constitute an emerging class of collinear magnets that exhibit\nzero net magnetization yet host spin-split electronic bands arising from\nnon-relativistic spin-space-group symmetries. Realization of altermagnetism in\nthe two-dimensional (2D) limit remains an outstanding challenge because\ndimensional reduction suppresses kZ dispersion and destabilizes the symmetry\noperations essential for spin compensation. Here, we demonstrate genuine 2D\naltermagnetism in epitaxial unit-cell-thin films of CrSb grown on Bi2Te3. It\nreveals a thickness-driven transition from a ferrimagnetic state in 1-unit-cell\nfilms to an altermagnetic state above a critical thickness of 7/4 unit cell.\nThe transition originates from interfacial symmetry breaking at the\nCr-terminated layer that induces local moment imbalance. With increasing\nthickness the key spin-space-group symmetries [C2||C6Zt] and [C2||MZ] restores,\nwhich leads to altermagnetism with zero net magnetization and\nmomentum-dependent spin splitting. Our results provide the first experimental\nrealization of altermagnetism in the 2D regime and establish a route for\nintegrating stray-field-free spin order into nanoscale spintronic\narchitectures.",
    "authors": [
      "Keren Li",
      "Yuzhong Hu",
      "Yue Li",
      "Ruohang Xu",
      "Heping Li",
      "Kun Liu",
      "Chen Liu",
      "Jincheng Zhuang",
      "Yee Sin Ang",
      "Jiaou Wang",
      "Haifeng Feng",
      "Weichang Hao",
      "Yi Du"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.12344v1",
    "entry_id": "http://arxiv.org/abs/2510.12344v1",
    "published": "2025-10-14T09:56:50+00:00",
    "updated": "2025-10-14T09:56:50+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12344v1.pdf"
  },
  {
    "id": "2510.10646v1",
    "title": "Near-room-temperature antiferromagnetism in Janus Fe$X$F ($X$ = O, S) monolayers",
    "abstract": "Inspired by the recently synthesized hexagonal layered phase of FeF$_2$, we\nstudied the magnetic properties of the 1T-FeF$_2$ monolayer and its Janus\nFe$X$F ($X$ = O, S) derivatives by first-principles calculations. Our results\nconfirm that these materials are antiferromagnetic semiconductors, and that\nanion substitution effectively tunes their material properties: the band gap\nshifts from 3.37 eV (direct, FeF$_2$) to 2.35 eV (direct, FeOF) and 1.13 eV\n(indirect, FeSF); the magnetic moment of Fe ions increases; and the N\\'{e}el\ntemperature ($T_N$) rises dramatically to 248 K (FeSF) and 207 K (FeOF). Janus\nstructures exhibit enhanced magnetic moment and direct AFM coupling. Under\ncompression, $T_N$ is further optimized to 274 K ($-2$\\% strain, FeSF) and 244\nK ($-5$\\% strain, FeOF). Both Janus materials retain their semiconducting\nnature and direction of easy magnetization axis under $\\pm5$\\% strain. This\nstudy validates the Janus structure as a viable approach to enhance 2D\nantiferromagnetism and highlights Fe-based oxyhalides as promising spintronic\nmaterials.",
    "authors": [
      "Xixiang Zhang",
      "Busheng Wang",
      "Yanfeng Ge",
      "Yong Liu",
      "Wenhui Wan"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10646v1",
    "entry_id": "http://arxiv.org/abs/2510.10646v1",
    "published": "2025-10-12T14:59:54+00:00",
    "updated": "2025-10-12T14:59:54+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10646v1.pdf"
  },
  {
    "id": "2510.10463v1",
    "title": "The significance of two-way coupling in two-dimensional, dusty turbulence",
    "abstract": "The significance of small-scale forcing of particles on the carrier\ntwo-dimensional turbulent flow has been shown [Pandey, Perlekar, and Mitra,\nPhys. Rev. E, 100, 013114 (2019)] to influence the spectral scaling properties\nof the carrier fluid. We investigate possible consequences of such two-way\ncoupling in a turbulent suspension of inertial particles in one and two-point\nEulerian and Lagrangian statistics. In particular, we find signatures of a\npossibly enhanced intermittency in the vorticity distributions. We characterize\nthe changes in the (small-scale) geometry of the flow via the Okubo-Weiss\nparameter. Finally, we examine the scaling properties of the second-order\n(vorticity) structure functions and find a non-trivial form of scale-invariance\nat finite mass-loading. This suggests that a dual-scale forcing mechanism on\nthe two-dimensional Navier-Stokes equation may be an effective model to mimic\nthe role of particle feedback in turbulence.",
    "authors": [
      "Harshit Joshi",
      "Samriddhi Sankar Ray"
    ],
    "categories": [
      "physics.flu-dyn",
      "cond-mat.stat-mech"
    ],
    "primary_category": "physics.flu-dyn",
    "pdf_url": "http://arxiv.org/pdf/2510.10463v1",
    "entry_id": "http://arxiv.org/abs/2510.10463v1",
    "published": "2025-10-12T06:11:35+00:00",
    "updated": "2025-10-12T06:11:35+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10463v1.pdf"
  },
  {
    "id": "2510.12557v1",
    "title": "Transport properties of stochastic fluids",
    "abstract": "We study heat conduction and momentum transport in the context of stochastic\nfluid dynamics. We consider a fluid described by model H in the classification\nof Hohenberg and Halperin. We study both non-critical and critical fluids, and\nwe investigate transport properties in two as well as three dimensions. Our\nresults are based on numerical simulations of model H using a Metropolis\nalgorithm, and we employ Kubo relations to extract transport coefficients. We\nobserve the expected logarithmic divergence of the shear viscosity in a\ntwo-dimensional non-critical fluid. At a critical point, we find that the\ntransport coefficients exhibit power-law scaling with the system size $L$. The\nstrongest divergence is seen for the thermal conductivity $\\kappa$ in two\ndimensions. We find $\\kappa\\sim L^{x_\\kappa}$ with $x_\\kappa=1.6\\pm 0.1$. The\ndivergence is weaker in three dimensions, $x_\\kappa=1.25 \\pm 0.3$, and the\nscaling exponent for the shear viscosity, $x_\\eta$, is significantly smaller\nthan $x_\\kappa$ in both two and three dimensions.",
    "authors": [
      "Chandrodoy Chattopadhyay",
      "Josh Ott",
      "Thomas Schaefer",
      "Vladimir V. Skokov"
    ],
    "categories": [
      "nucl-th",
      "cond-mat.quant-gas",
      "hep-ph"
    ],
    "primary_category": "nucl-th",
    "pdf_url": "http://arxiv.org/pdf/2510.12557v1",
    "entry_id": "http://arxiv.org/abs/2510.12557v1",
    "published": "2025-10-14T14:20:40+00:00",
    "updated": "2025-10-14T14:20:40+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12557v1.pdf"
  },
  {
    "id": "2510.11580v1",
    "title": "Disorder to Order Transition in 1D Nonreciprocal Cahn-Hilliard Model",
    "abstract": "We extensively study the phenomenology of one dimensional Nonreciprocal Cahn\nHilliard model for varying nonreciprocity $(\\alpha)$ and different boundary\nconditions. At small $\\alpha$, a perturbed uniform state evolves to a defect\nladen configuration that lacks global polar order. Defects are the sources and\nsinks of travelling waves and nonreciprocity selects defects with a unique wave\nnumber that increases monotonically with $\\alpha_c$. A critical threshold\n$\\alpha_c$ marks the onset of a transition to states with finite global polar\norder. For periodic boundaries, above $\\alpha_c$, the system shows travelling\nwaves that are completely ordered. In contrast, travelling waves are\nincompatible with Dirichlet and Neumann boundaries. Instead, for $\\alpha\n\\gtrsim \\alpha_c$, we find fluctuating domains that show intermittent polar\norder and at large $\\alpha$, the system partitions into two domains with\nopposite polar order.",
    "authors": [
      "Navdeep Rana",
      "Ramin Golestanian"
    ],
    "categories": [
      "cond-mat.soft",
      "cond-mat.stat-mech",
      "physics.comp-ph"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.11580v1",
    "entry_id": "http://arxiv.org/abs/2510.11580v1",
    "published": "2025-10-13T16:24:59+00:00",
    "updated": "2025-10-13T16:24:59+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11580v1.pdf"
  },
  {
    "id": "2510.12286v1",
    "title": "Train Stochastic Non Linear Coupled ODEs to Classify and Generate",
    "abstract": "A general class of dynamical systems which can be trained to operate in\nclassification and generation modes are introduced. A procedure is proposed to\nplant asymptotic stationary attractors of the deterministic model. Optimizing\nthe dynamical system amounts to shaping the architecture of inter-nodes\nconnection to steer the evolution towards the assigned equilibrium, as a\nfunction of the class to which the item - supplied as an initial condition -\nbelongs to. Under the stochastic perspective, point attractors are turned into\nprobability distributions, made analytically accessible via the linear noise\napproximation. The addition of noise proves beneficial to oppose adversarial\nattacks, a property that gets engraved into the trained adjacency matrix and\ntherefore also inherited by the deterministic counterpart of the optimized\nstochastic model. By providing samples from the target distribution as an input\nto a feedforward neural network (or even to a dynamical model of the same\ntypology of the adopted for classification purposes), yields a fully generative\nscheme. Conditional generation is also possible by merging classification and\ngeneration modalities. Automatic disentanglement of isolated key features is\nfinally proven.",
    "authors": [
      "Stefano Gagliani",
      "Feliciano Giuseppe Pacifico",
      "Lorenzo Chicchi",
      "Duccio Fanelli",
      "Diego Febbe",
      "Lorenzo Buffoni",
      "Raffaele Marino"
    ],
    "categories": [
      "cond-mat.dis-nn",
      "cond-mat.stat-mech"
    ],
    "primary_category": "cond-mat.dis-nn",
    "pdf_url": "http://arxiv.org/pdf/2510.12286v1",
    "entry_id": "http://arxiv.org/abs/2510.12286v1",
    "published": "2025-10-14T08:41:42+00:00",
    "updated": "2025-10-14T08:41:42+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12286v1.pdf"
  },
  {
    "id": "2510.12690v1",
    "title": "Formation of C-centers in Si-based systems by light ion irradiation",
    "abstract": "Atomic-scale crystal defects in Si are quantum-light sources offering\ntantalizing integration with existing photonic technologies. Yet, the\ncontrolled creation of near-infrared color centers for long- haul quantum\ncommunication and information still remains a challenge. In this work, we\nutilize light ions, such as H+ and He+, to gently generate quantum emitters in\na crystalline Si matrix. Temperature-dependent photoluminescence measurements\ndemonstrate the presence of optically-active defects, whose fluorescence\nmatches the primary telecom window around 1550 nm. In addition, time-resolved\ninvestigations unveil long-lived excitonic states in the {\\mu}s regime, thus\nconfirming the formation of interstitial oxygen-carbon complexes, termed\nC-centers. Finally, we explored controlled ion irradiation strategies to\nseamlessly generate C-centers also in Ge-on-Si heterostructures, which offer an\nadvanced technological platform for the future realization of integrated\nquantum photonics. This analysis, informed by practical color center synthesis\nand proof-of-principle experiments in epitaxial architectures, indicates\nintriguing prospects and profitable strategies to advance the burgeoning field\nof light-based quantum technologies.",
    "authors": [
      "Carolina Crosta",
      "Riccardo Nardin",
      "Patrick Daoust",
      "Stefano Achilli",
      "Ian Colombo",
      "Matteo Campostrini",
      "Emiliano Bonera",
      "Jacopo Pedrini",
      "Oussama Moutanabbir",
      "Valentino Rigato",
      "Fabio Pezzoli"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.12690v1",
    "entry_id": "http://arxiv.org/abs/2510.12690v1",
    "published": "2025-10-14T16:24:58+00:00",
    "updated": "2025-10-14T16:24:58+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12690v1.pdf"
  },
  {
    "id": "2510.10911v1",
    "title": "Delayed 1T to 2H Phase Transition Upon Electrochemical Delithiation of LiMoS2",
    "abstract": "Molybdenum disulfide (MoS2) is a widely studied layered material for\nelectronic, optical, and catalytic applications. It can host lithium ions\nbetween the van der Waals layers, which triggers a phase transition between the\nsemiconducting 2H phase and metallic 1T phase. While lithium insertion triggers\na phase transition to the 1T phase, the phase behavior upon electrochemical\nlithium removal is not resolved. In this work, we conduct single-flake\nelectrochemical (de)lithiation of MoS2 using microelectrode arrays. Through\nboth electrochemical voltage analysis and correlative Raman spectroscopy, we\nshow that an electrochemically cycled and delithiated MoS2 flake initially\nremains in the 1T phase. However, over the course of several days, it\ntransitions back into the thermodynamically stable 2H phase. This result\nresolves the phase transformation pathway upon delithiation and showcases the\nability to electrochemically synthesize the metastable 1T-MoS2 phase.",
    "authors": [
      "Yerin Hong",
      "Juhwan Lim",
      "Jinhong Min",
      "Nishkarsh Agarwal",
      "Robert Hovden",
      "Ageeth A. Bol",
      "Yiyang Li"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "eess.AS"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10911v1",
    "entry_id": "http://arxiv.org/abs/2510.10911v1",
    "published": "2025-10-13T02:13:56+00:00",
    "updated": "2025-10-13T02:13:56+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10911v1.pdf"
  },
  {
    "id": "2510.12678v1",
    "title": "The Popkov-Schütz two-lane lattice gas: Universality for general jump rates",
    "abstract": "We consider the asymmetric version of the Popkov-Sch\\\"{u}tz two-lane lattice\ngas with general jump rates, subject to the stationary measure being of product\nform. This still leaves five free parameters. At density $\\tfrac{1}{2}$ the\neigenvalues of the flux Jacobian are degenerate. We compute the second order\nexpansion of the average fluxes at density $\\tfrac{1}{2}$ and thereby identify\nthe universality classes.",
    "authors": [
      "Herbert Spohn"
    ],
    "categories": [
      "cond-mat.stat-mech",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "cond-mat.stat-mech",
    "pdf_url": "http://arxiv.org/pdf/2510.12678v1",
    "entry_id": "http://arxiv.org/abs/2510.12678v1",
    "published": "2025-10-14T16:17:01+00:00",
    "updated": "2025-10-14T16:17:01+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12678v1.pdf"
  },
  {
    "id": "2510.11936v1",
    "title": "Thermal transport in GaN/AlN HEMTs on 4H-SiC: Role of layer thickness and hetero-interfaces",
    "abstract": "Thermal transport in high-electron-mobility-transistor (HEMT) structures\ngrown on 4H-SiC substrates by metalorganic-vapour-phase epitaxy (MOCVD) is\nsystematically investigated. The thermal conductivity of the GaN channel and\nAlN buffer layers is measured by thermoreflectance (TTR). A pronounced\nthickness dependence of thermal conductivity as a result of phonon-boundary\nscattering is observed at low temperatures, while this effect becomes\nsignificantly weaker at elevated temperatures. The thermal boundary resistance\n(TBR) at the AlN/4H-SiC and GaN/AlN interfaces is also examined, showing a\nsubstantial reduction and eventual saturation with increasing temperature,\nindicating elastic phonon transport as the dominant mechanism. Reliable\nsimulations of the temperature profile across the structures based on the\nmeasured thermal metrics highlight the critical role of TBR in thin-channel\ndevice and the advantage of thicker channel and buffer layers for efficient\nheat dissipation in the HEMTs.",
    "authors": [
      "Dat Q. Tran",
      "Minho Kim",
      "Okhyun Nam",
      "Vanya Darakchieva",
      "Plamen P. Paskov"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.11936v1",
    "entry_id": "http://arxiv.org/abs/2510.11936v1",
    "published": "2025-10-13T21:01:06+00:00",
    "updated": "2025-10-13T21:01:06+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11936v1.pdf"
  },
  {
    "id": "2510.09999v1",
    "title": "Random State Approach to Quantum Computation of Electronic-Structure Properties",
    "abstract": "Classical computation of electronic properties in large-scale materials\nremains challenging. Quantum computation has the potential to offer advantages\nin memory footprint and computational scaling. However, general and practical\nquantum algorithms for simulating large-scale materials are still lacking. We\npropose and implement random-state quantum algorithms to calculate\nelectronic-structure properties of real materials. Using a random state circuit\nwith only a few qubits, we employ real-time evolution with first-order Trotter\ndecomposition and Hadamard test to obtain electronic density of states, and we\ndevelop a modified quantum phase estimation algorithm to calculate real-space\nlocal density of states via direct quantum measurements. Furthermore, we\nvalidate these algorithms by numerically computing the density of states and\nspatial distributions of electronic states in graphene, twisted bilayer\ngraphene quasicrystals, and fractal lattices, covering system sizes from\nhundreds to thousands of atoms. Our results manifest that the random-state\nquantum algorithms provide a general and qubit-efficient route to simulating\nelectronic properties of large-scale periodic and aperiodic materials on\nquantum computers.",
    "authors": [
      "Yiran Bai",
      "Feng Xiong",
      "Xueheng Kuang"
    ],
    "categories": [
      "physics.comp-ph",
      "cond-mat.mtrl-sci",
      "quant-ph"
    ],
    "primary_category": "physics.comp-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.09999v1",
    "entry_id": "http://arxiv.org/abs/2510.09999v1",
    "published": "2025-10-11T03:51:23+00:00",
    "updated": "2025-10-11T03:51:23+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.09999v1.pdf"
  },
  {
    "id": "2510.10693v1",
    "title": "High-Dimensional Learning Dynamics of Quantized Models with Straight-Through Estimator",
    "abstract": "Quantized neural network training optimizes a discrete, non-differentiable\nobjective. The straight-through estimator (STE) enables backpropagation through\nsurrogate gradients and is widely used. While previous studies have primarily\nfocused on the properties of surrogate gradients and their convergence, the\ninfluence of quantization hyperparameters, such as bit width and quantization\nrange, on learning dynamics remains largely unexplored. We theoretically show\nthat in the high-dimensional limit, STE dynamics converge to a deterministic\nordinary differential equation. This reveals that STE training exhibits a\nplateau followed by a sharp drop in generalization error, with plateau length\ndepending on the quantization range. A fixed-point analysis quantifies the\nasymptotic deviation from the unquantized linear model. We also extend\nanalytical techniques for stochastic gradient descent to nonlinear\ntransformations of weights and inputs.",
    "authors": [
      "Yuma Ichikawa",
      "Shuhei Kashiwamura",
      "Ayaka Sakata"
    ],
    "categories": [
      "stat.ML",
      "cond-mat.dis-nn",
      "cs.AI",
      "cs.LG",
      "math.ST",
      "stat.TH"
    ],
    "primary_category": "stat.ML",
    "pdf_url": "http://arxiv.org/pdf/2510.10693v1",
    "entry_id": "http://arxiv.org/abs/2510.10693v1",
    "published": "2025-10-12T16:43:46+00:00",
    "updated": "2025-10-12T16:43:46+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10693v1.pdf"
  },
  {
    "id": "2510.11450v1",
    "title": "Nonanaliticities and ergodicity breaking in noninteracting many-body dynamics via stochastic resetting and global measurements",
    "abstract": "Stochastic resetting generates nonequilibrium steady states by interspersing\nunitary quantum dynamics with resets at random times. When the state to which\nthe system is reset is chosen conditionally on the outcome of a global and\nspatially resolved measurement, the steady state can feature collective\nbehavior similar to what is typically observed at phase transitions. Here we\ninvestigate such conditional reset protocol in a system of noninteracting\nspins, where the reset state is chosen as a magnetization eigenstate, that is\nselected (conditioned) on the outcome of a previous magnetization measurement.\nThe stationary states that emerge from this protocol are characterized by the\ndensity of spins in a given magnetization eigenstate, which is the analogue of\nthe order parameter. The resulting stationary phase diagram features multiple\nnonanalytic points. They are of first-order type for half-integer spin, while\nmulticritical behavior, signalled by both first and second-order\ndiscontinuities, is found for integer spin. We also show that the associated\ndynamics is nonergodic, i.e., which stationary state the system ultimately\nassumes is determined be the initial state. Interestingly, the mechanism\nunderlying these phenomena does not rely on interactions, but the emergent\nnonlinear behavior is solely a consequence of correlations induced by the\nmeasurement.",
    "authors": [
      "David Soldner",
      "Igor Lesanovsky",
      "Gabriele Perfetto"
    ],
    "categories": [
      "cond-mat.stat-mech"
    ],
    "primary_category": "cond-mat.stat-mech",
    "pdf_url": "http://arxiv.org/pdf/2510.11450v1",
    "entry_id": "http://arxiv.org/abs/2510.11450v1",
    "published": "2025-10-13T14:22:10+00:00",
    "updated": "2025-10-13T14:22:10+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11450v1.pdf"
  },
  {
    "id": "2510.09861v1",
    "title": "Predicting Crystal Structures and Ionic Conductivity in Li$_{3}$YCl$_{6-x}$Br$_{x}$ Halide Solid Electrolytes Using a Fine-Tuned Machine Learning Interatomic Potential",
    "abstract": "This work demonstrates the effectiveness of fine-tuning the CHGNet universal\nmachine learning interatomic potential (uMLIP) to investigate ionic transport\nmechanisms in ternary halide solid electrolytes of the\nLi$_{3}$YCl$_{6-x}$Br$_{x}$ family (x = 0 to 6), which are promising candidates\nfor solid-state battery applications. We present a strategy for generating\nordered structural models from experimentally derived disordered\nLi$_{3}$YCl$_{6}$ (LYC) and Li$_{3}$YBr$_{6}$ (LYB) structures. These serve as\ninitial configurations for an iterative fine-tuning workflow that couples\nmolecular dynamics (MD) simulations with static density functional theory (DFT)\ncalculations. The fine-tuning process and the resulting improvements in\npredictive accuracy are benchmarked across energy predictions, structure\noptimizations, and diffusion coefficient calculations. Finally, we analyze the\ninfluence of composition (varied x) on the predicted ionic conductivity in\nLi$_{3}$YCl$_{6-x}$Br$_{x}$, demonstrating the robustness of our approach for\nmodeling transport properties in complex solid electrolytes.",
    "authors": [
      "Jonas Böhm",
      "Aurélie Champagne"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.comp-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.09861v1",
    "entry_id": "http://arxiv.org/abs/2510.09861v1",
    "published": "2025-10-10T20:53:55+00:00",
    "updated": "2025-10-10T20:53:55+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.09861v1.pdf"
  },
  {
    "id": "2510.09832v1",
    "title": "Stable High-Order Vortices in Spin-Orbit-Coupled Spin-1 Bose-Einstein Condensates",
    "abstract": "The present contribution explores phase transitions that occur in the ground\nstate (GS) of spin-1 Bose-Einstein condensates (BECs) with spin-orbit coupling\n(SOC) under the action of gradient\n  magnetic fields. By solving the corresponding linearized system in an exact\nfashion, we identify the\n  conditions under which the GS phase transitions occur, thus transforming\nexcited states into GS.\n  The study of the full nonlinear system, including both density-density and\nspin-spin interactions,\n  is numerically analyzed. For the case of repulsive spin-spin interactions,\nthe results resemble the\n  linear case, while attractive spin-spin interactions lead to the formation of\nmixed-states near the GS\n  phase-transition points. Additionally, higher-order vortex solitons are found\nto be stable even in\n  the nonlinear regime. These findings demonstrate that arbitrary winding\nnumbers can be achieved\n  as corresponding to stable GS and thus contributing to the understanding of\ntopological properties\n  in SOC BECs.",
    "authors": [
      "Xin-Feng Zhang",
      "Huan-Bo Luo",
      "Josep Batle",
      "Bin Liu",
      "Yongyao Li"
    ],
    "categories": [
      "cond-mat.quant-gas",
      "nlin.PS"
    ],
    "primary_category": "cond-mat.quant-gas",
    "pdf_url": "http://arxiv.org/pdf/2510.09832v1",
    "entry_id": "http://arxiv.org/abs/2510.09832v1",
    "published": "2025-10-10T20:07:20+00:00",
    "updated": "2025-10-10T20:07:20+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.09832v1.pdf"
  },
  {
    "id": "2510.10919v1",
    "title": "Generalized quantum limits of electrical contact resistance and thermal boundary resistance",
    "abstract": "The importance of electrical contact resistance and thermal boundary\nresistance has increased dramatically as devices are scaled to atomic limits.\nThe use of a rich range of materials with various bandstructures (e.g.\nparabolic, conical), and in geometries exploiting various dimensionalities\n(e.g. 1D wires, 2D sheets, and 3D bulk) will increase in the future. Here we\nderive a single general expression for the quantum limit of electrical contact\nresistivity for various bandstructures and all dimensions. A corresponding\nresult for the quantum limit of thermal boundary resistance is also derived.\nThese results will be useful to quantitatively co-design, benchmark, and guide\nthe lowering of electrical and thermal boundary resistances for energy\nefficient devices.",
    "authors": [
      "Alice Ho",
      "Jashan Singhal",
      "Deji Akinwande",
      "Huili Grace Xing",
      "Debdeep Jena"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10919v1",
    "entry_id": "http://arxiv.org/abs/2510.10919v1",
    "published": "2025-10-13T02:29:50+00:00",
    "updated": "2025-10-13T02:29:50+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10919v1.pdf"
  },
  {
    "id": "2510.10831v1",
    "title": "Emerging Ferroelectric Domains: Stacking and Rotational Landscape of MoS2 Moire Bilayers",
    "abstract": "The structures and properties of moire patterns in twisted bilayers of\ntwo-dimensional (2D) materials are known to depend sensitively on twist angle,\nyet their dependence on stacking order remains comparatively underexplored. In\nthis study, we use molecular dynamics simulations to systematically investigate\nthe combined effects of stacking order and rotation in MoS2 bilayers. Beginning\nfrom five well-established high-symmetry bilayer stackings, we apply twist\nangles between 1 and 120 to the top layer, revealing a variety of relaxed moire\nstructures. Our results show that the initial stacking significantly influences\nthe moire domain configurations that emerge at a given twist angle. While all\nfive stacking orders are metastable without twist, they form two\nmoire-equivalent classes- AA/AB and AA',A'B,AB', i.e., for a given twist angle,\nstructures within each class relax to the same moire configuration.\nSpecifically, initial AA and AB stackings give rise to triangular ferroelectric\ndomains near 0+/-3, while AA', A'B, and AB' stackings produce triangular\nferroelectric domains near 60+/-3. At precisely 60 and 120 twists, the bilayers\nrelax to into pure high-symmetry stackings, highlighting the rotational\nrelationships between these configurations and explaining the shift of 60 in\nthe ferroelectric rotational range. These findings demonstrate the critical\nrole of stacking order in governing the rich moire landscapes accessible in\ntwistronic systems.",
    "authors": [
      "Anikeya Aditya",
      "Ayu Irie",
      "Nabankur Dasgupta",
      "Rajiv K. Kalia",
      "Aiichiro Nakano",
      "Priya Vashishta"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10831v1",
    "entry_id": "http://arxiv.org/abs/2510.10831v1",
    "published": "2025-10-12T22:48:24+00:00",
    "updated": "2025-10-12T22:48:24+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10831v1.pdf"
  },
  {
    "id": "2510.10555v1",
    "title": "Breaking the Sabatier Principle by Dynamic Adsorption-Desorption Decoupling in Electrocatalytic Hydrogen Evolution",
    "abstract": "The Sabatier principle establishes a fundamental trade-off in heterogeneous\nelectrocatalysis.In the hydrogen evolution reaction (HER), this trade-off is\nmanifested by the coupling of Volmer step, which requires strong hydrogen\nadsorption, with the Heyrovsky/Tafel step, which favors facile desorption, thus\ngiving rise to the classical volcano relationship and limiting activity even at\n$\\Delta G=0$. Here, we demonstrate a ferroelectric platform with dynamic\ntunability -- monolayer GeS$_2$ decorated with transition metal atoms as a\nproof-of-concept -- where polarization-driven surface electronic reconstruction\nenables real-time modulation of intermediate binding strength, thereby breaking\nthe Sabatier constraint. Reversible control of hydrogen adsorption allows\nstrong H binding to accelerate the Volmer step, followed by weakened adsorption\nto promote the Heyrovsky/Tafel step.This dynamic adsorption-desorption\ndecoupling not only surpasses the volcano limit to achieve unprecedented HER\nactivity, but also establishes a general paradigm for designing adaptive\nelectrocatalysts capable of reconfiguring under operating conditions.",
    "authors": [
      "Zi-Xuan Yang",
      "Lei Li",
      "Tao Huang",
      "Hui Wan",
      "X. S. Wang",
      "Gui-Fang Huang",
      "Wangyu Hu",
      "Wei-Qing Huang"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10555v1",
    "entry_id": "http://arxiv.org/abs/2510.10555v1",
    "published": "2025-10-12T11:39:22+00:00",
    "updated": "2025-10-12T11:39:22+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10555v1.pdf"
  },
  {
    "id": "2510.12655v1",
    "title": "AI-Assisted Physics-Informed Predictions of Degradation Behavior of Polymeric Anion Exchange Membranes",
    "abstract": "The global transition to hydrogen-based energy infrastructures faces\nsignificant hurdles. Chief among these are the high costs and sustainability\nissues associated with acid-based proton exchange membrane fuel cells. Anion\nexchange membrane (AEM) fuel cells offer promising cost-effective alternatives,\nyet their widespread adoption is limited by rapid degradation in alkaline\nenvironments. Here, we develop a framework that integrates mechanistic insights\nwith machine learning, enabling the identification of generalized degradation\nbehavior across diverse polymeric AEM chemistries and operating conditions. Our\nmodel successfully predicts long-term hydroxide conductivity degradation (up to\n10,000 hours) from minimal early-time experimental data. This capability\nsignificantly reduces experimental burdens and may expedite the design of\nhigh-performance, durable AEM materials.",
    "authors": [
      "William Schertzer",
      "Mohamed Al Otmi",
      "Janani Sampath",
      "Ryan P. Lively",
      "Rampi Ramprasad"
    ],
    "categories": [
      "cond-mat.soft"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.12655v1",
    "entry_id": "http://arxiv.org/abs/2510.12655v1",
    "published": "2025-10-14T15:49:49+00:00",
    "updated": "2025-10-14T15:49:49+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12655v1.pdf"
  },
  {
    "id": "2510.11134v1",
    "title": "Spinon band flattening by its emergent gauge field in quantum kagome ice",
    "abstract": "Fractional excitations provide a key to identifying sought-after topological\nquantum spin liquid states in realistic materials. Their single-particle\ndynamics already presents a challenging many-body problem on account of the\ncoupling to their emergent gauge field. Here, we study the spinon excitations\nof kagome ice, realized at the $2/3$ magnetization plateau of spin ice, by\ncombining up-to-$63$-site exact diagonalization with an analytical state graph\nmapping. We find a macroscopically degenerate mode in the spinon spectrum. It\noriginates from the destructive interference due to the interaction with\nsurrounding gauge fields, a form of many-body caging. We explicitly construct,\nand count, the concomitant many-body wave functions. Finally, we discuss the\npossible role of these flat modes in the magnetization process of kagome\nantiferromagnets, in particular with regard to the asymmetric termination of\nthe kagome ice magnetisation plateau.",
    "authors": [
      "Masafumi Udagawa",
      "Roderich Moessner"
    ],
    "categories": [
      "cond-mat.str-el",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.str-el",
    "pdf_url": "http://arxiv.org/pdf/2510.11134v1",
    "entry_id": "http://arxiv.org/abs/2510.11134v1",
    "published": "2025-10-13T08:24:43+00:00",
    "updated": "2025-10-13T08:24:43+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11134v1.pdf"
  },
  {
    "id": "2510.10595v1",
    "title": "Weak-anti-localization-to-spin-dependent scattering at a proximity-magnetized heavy metal interface",
    "abstract": "A change in a materials electrical resistance with magnetic field\n(magnetoresistance) results from quantum interference effects and, or\nspin-dependent transport, depending on materials properties and dimensionality.\nIn disordered conductors, electron interference leads to weak localization or\nanti-localization; in contrast, ferromagnetic conductors support spin-dependent\nscattering, leading to giant magnetoresistance (GMR). By varying the thickness\nof Au between 4 and 28 nm in a EuS/Au/EuS spin-switches, we observe a crossover\nfrom weak anti-localization to interfacial GMR. The crossover is related to a\nmagnetic proximity effect in Au due to electron scattering at the insulating\nEuS interface. The proximity-induced exchange field in Au suppresses weak\nanti-localization, consistent with Maekawa-Fukuyama theory. With increasing Au\nthickness, GMR emerges along with spin Hall magnetoresistance. These findings\ndemonstrate spin transport governed by interfacial exchange fields, building a\nframework for spintronic functionality without metallic magnetism.",
    "authors": [
      "Hisakazu Matsuki",
      "Guang Yang",
      "Jiahui Xu",
      "Vitaly N. Golovach",
      "Yu He",
      "Jiaxu Li",
      "Alberto Hijano",
      "Niladri Banerjee",
      "Iuliia Alekhina",
      "Nadia Stelmashenko",
      "F. Sebastian Bergeret",
      "Jason W. A. Robinson"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "cond-mat.mes-hall"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10595v1",
    "entry_id": "http://arxiv.org/abs/2510.10595v1",
    "published": "2025-10-12T13:29:06+00:00",
    "updated": "2025-10-12T13:29:06+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10595v1.pdf"
  },
  {
    "id": "2510.10897v1",
    "title": "Hydrodynamics of degenerate Fermi gases on spherical Fermi surfaces",
    "abstract": "We consider the description of a Fermi gas of free electrons given by the\nBoltzmann--Fermi--Dirac equation, and aim at providing a precise mathematical\nunderstanding of the Fermi ground state and its first-order approximation of\nexcited states on the Fermi sphere.\n  In order to achieve that, using the framework of hydrodynamic limits in\ncollisional kinetic theory, we identify the low-temperature regimes in which\ncharge-density fluctuations concentrate on the Fermi sphere. In three spatial\ndimensions or higher, we also characterize the thermodynamic equilibra and\nenergy spectra of fluctuations. This allows us to derive the macroscopic\nhydrodynamic equations describing how charge densities flow and propagate in\nmetals, thereby providing a precise description of plasma oscillations in\nconductors. The two-dimensional case is fundamentally different and is handled\nin a companion article.\n  Remarkably, our results establish that excited electrons and their energy can\nbe distributed on the Fermi sphere anisotropically, which deviates from the\ncommon intuitive assumption that electrons and their energy should be\ndistributed uniformly in all directions.\n  The hydrodynamic regimes featured in this work are akin to the acoustic limit\nof the classical Boltzmann equation. However, we emphasize that our derivation\nholds for arbitrarily fast rates of convergence of the Knudsen number, which\nsignificantly extends the applicability of the known proofs of the classical\nacoustic limit. This suggest that low-temperature limits of Fermi gases provide\na promising avenue of research toward a complete understanding of the\ncompressible Euler limit.",
    "authors": [
      "Benjamin Anwasia",
      "Diogo Arsénio"
    ],
    "categories": [
      "math.AP",
      "cond-mat.mes-hall",
      "cond-mat.quant-gas",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "math.AP",
    "pdf_url": "http://arxiv.org/pdf/2510.10897v1",
    "entry_id": "http://arxiv.org/abs/2510.10897v1",
    "published": "2025-10-13T01:49:45+00:00",
    "updated": "2025-10-13T01:49:45+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10897v1.pdf"
  },
  {
    "id": "2510.11285v1",
    "title": "Bright Single-Photon Emission from Individual Tin-Vacancy Centers in Multi-Cone Diamond Waveguides",
    "abstract": "Diamonds containing color centers have recently gathered significant\nattention for photonic quantum technologies, including quantum sensing,\nphotonic quantum computers, and quantum networks. Among the various color\ncenters, tin-vacancy (SnV) centers are particularly promising due to the high\nemission efficiency from the zero-phonon line and due to their long spin\ncoherence times. However, the extraction of photons from diamond remains a key\nchallenge. Here we demonstrate high photon extraction from a single SnV center\nincorporated in a diamond nanopillar with tapered sidewalls and a multi-cone\nstructure. A sharp emission peak with a full width at half maximum (FWHM) of\n$6\\,$nm was observed at a wavelength of $619\\,$nm. Furthermore, the\nsecond-order correlation function exhibited an antibunching dip well below\n$g^{(2)}(0) = 0.5$, indicating single-photon emission. Remarkably, the emitter\nachieved a high saturation count rate of approximately $9\\,$Mcps. These results\nestablish our nanopillar platform as a promising candidate for bright and\nstable quantum sources and sensors based on SnV centers in diamond.",
    "authors": [
      "Pablo Tieben",
      "Jan Rhensius",
      "Takuya F. Segawa",
      "Risei Abe",
      "Konosuke Shimazaki",
      "Shigeki Takeuchi",
      "Andeas W. Schell",
      "Hideaki Takashima"
    ],
    "categories": [
      "quant-ph",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "quant-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.11285v1",
    "entry_id": "http://arxiv.org/abs/2510.11285v1",
    "published": "2025-10-13T11:19:50+00:00",
    "updated": "2025-10-13T11:19:50+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11285v1.pdf"
  },
  {
    "id": "2510.11995v1",
    "title": "The Comparison of Colloidal PbS QD Photoconductors and Hybrid Phototransistors",
    "abstract": "The simplicity in the fabrication of photoconductors makes them a valuable\nchoice to investigate optoelectronic properties of colloidal quantum dot (cQD)\nfilms. Lateral photoconductors generally require a large size, in the mm2, and\nare limited in operation speed due to the presence of trapping sites. In\ncontrast, hybrid phototransistors are fabricated in the um2 scale and benefit\nfrom such trapping sites, allowing the measurement of low light levels in the\nnW/cm2. The question, however, arises whether high responsivity values are\nrequired for the detection of low light levels or the compatible detectivity of\nphotoconductors is sufficient. Here, we directly compare photoconductors and\nhybrid phototransistors with an identical EDT-treated PbS cQD film. We\nhighlight that a comparable D* is not enough for the purpose of measuring low\nlight levels, as the resulting photocurrents need to be readily accessible.\nFurthermore, we also showcase temperature-activated photocurrent dynamics\nresulting in a negative photocurrent (NPC) effect. This NPC simultaneously\nimproves the frequency bandwidth and photocurrent, enabling operation speeds up\nto 100 kHz.",
    "authors": [
      "Gökhan Kara",
      "Lorenzo J. A. Ferraresi",
      "Dmitry N. Dirin",
      "Roman Furrer",
      "Maksym V. Kovalenko",
      "Michel Calame",
      "Ivan Shorubalko"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.11995v1",
    "entry_id": "http://arxiv.org/abs/2510.11995v1",
    "published": "2025-10-13T22:51:19+00:00",
    "updated": "2025-10-13T22:51:19+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11995v1.pdf"
  },
  {
    "id": "2510.10479v1",
    "title": "Growth control of highly textured Bi2Te3 thin films by pulsed laser deposition",
    "abstract": "Two-dimensional materials have attracted growing interest due to their unique\nelectronic properties and potential applications in spintronics. Interfacing\nstrongly spin-orbit-coupled chalcogenides with functional oxides such as\nperovskites has a particularly high potential. In this work, highly textured\nBi2Te3 thin films were deposited on (111) oriented SrTiO3 by pulsed laser\ndeposition. We show that, by careful selection of the temperature and pressure\nof growth, the film's stoichiometry can be manipulated between direct\nstoichiometry transfer from the target and tellurium-deficient phases.\nOptimized pulsed laser deposition enables the growth of films with coalesced,\nfaceted grains with grain sizes reaching up to 430 nm, while preserving\ncrystalline quality comparable to that of molecular-beam-epitaxy-grown films.\nWe show striking differences arising from tuning the laser's pulsing frequency\nand fluence, which lead to changes in surface roughness, the film's porosity,\nand grain boundaries, as well as grain shape. Analysis of cross-sectional\ntransmission electron microscopy images reveals a sharp substrate-film\ninterface without atomic intermixing and without the formation of amorphous\nintermediate layers. The results demonstrate that pulsed laser deposition is a\nviable method for producing high-quality Bi2Te3 thin films and opens the door\nto the integration of chalcogenides with perovskites with this growth\ntechnique.",
    "authors": [
      "Damian Brzozowski",
      "Yu Liu",
      "Karola Neeleman",
      "Magnus Nord",
      "Ingrid G. Hallsteinsen"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10479v1",
    "entry_id": "http://arxiv.org/abs/2510.10479v1",
    "published": "2025-10-12T07:19:42+00:00",
    "updated": "2025-10-12T07:19:42+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10479v1.pdf"
  },
  {
    "id": "2510.10908v1",
    "title": "Two-dimensional flat-bands in Moire-diamonds",
    "abstract": "The discovery of flat-bands in magic-angle twisted bilayer graphene has\nunderscored the potential of moire engineering for correlated states, but such\nphases are notoriously difficult to realize and highly fragile against\nperturbations. Here, we propose an alternative route to flat-bands by\nintroducing sp3 hybridization in twisted graphite. Instead of relying on\nfine-tuned magic angles, our approach identifies flat-band states at relatively\nlarge twist angles with short moire periods. In this regime, sp3-induced\nreconstructions generate electronic states that, once formed, are locked by\nsubstantial energy barriers, rendering them robust against external\nperturbations. Using twisted graphite as a prototype, we uncover a series\nmoire-diamond that host two-dimensional flat conduction of valence bands, where\ncarriers are localized within specific momentum planes but remain dispersive\nalong orthogonal directions. The emergence of dimensional flat-bands opens a\nnew platform for flat-band-driven correlated physics and suggests opportunities\nfor designing quantum materials with highly directional electronic\nfunctionalities.",
    "authors": [
      "Yalan Wei",
      "Shifang Li",
      "Yuke Song",
      "Chaoyu He"
    ],
    "categories": [
      "cond-mat.mes-hall",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.10908v1",
    "entry_id": "http://arxiv.org/abs/2510.10908v1",
    "published": "2025-10-13T02:09:59+00:00",
    "updated": "2025-10-13T02:09:59+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10908v1.pdf"
  },
  {
    "id": "2510.11679v1",
    "title": "Observation of ballistic plasma and memory in high-energy gauge theory dynamics",
    "abstract": "Gauge theories describe the fundamental forces of nature. However,\nhigh-energy dynamics, such as the formation of quark-gluon plasmas, is\nnotoriously difficult to model with classical methods. Quantum simulation\noffers a promising alternative in this regime, yet experiments have mainly\nprobed low energies. Here, we observe the formation of a ballistic plasma and\nlong-time memory effects in high-energy gauge theory dynamics on a\nhigh-precision quantum simulator. Both observations are unexpected, as the\ninitial state - fully filled with particle-antiparticle pairs - was thought to\nrapidly thermalize. Instead, we find correlations spreading ballistically to\nlong distances and a memory of charge clusters. Our observations cannot be\nexplained by many-body scars, but are captured by a new theory of plasma\noscillations between electric field and current operators, persisting all the\nway to the continuum limit of the (1+1)D Schwinger model, of which we simulate\na lattice version. Adapting techniques from quantum optics, we visualize plasma\noscillations as rotations of Wigner distributions, leading to a novel set of\npredictions which we test in experiment and numerics. The new framework\nencompasses both our scenario and scars, which show up as coherent states of\nthe plasma. The experimental surprises we observe in the high-energy dynamics\nof a simple gauge theory point to the potential of high-precision quantum\nsimulations of gauge theories for general scientific discovery.",
    "authors": [
      "Daniel K. Mark",
      "Federica M. Surace",
      "Thomas Schuster",
      "Adam L. Shaw",
      "Wenjie Gong",
      "Soonwon Choi",
      "Manuel Endres"
    ],
    "categories": [
      "quant-ph",
      "cond-mat.quant-gas",
      "hep-lat",
      "hep-ph"
    ],
    "primary_category": "quant-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.11679v1",
    "entry_id": "http://arxiv.org/abs/2510.11679v1",
    "published": "2025-10-13T17:46:31+00:00",
    "updated": "2025-10-13T17:46:31+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11679v1.pdf"
  },
  {
    "id": "2510.10983v1",
    "title": "Loss investigations of high frequency lithium niobate Lamb wave resonators at ultralow temperatures",
    "abstract": "Lamb wave resonators (LWRs) operating at ultralow temperatures serve as\npromising acoustic platforms for implementing microwave-optical transduction\nand radio frequency (RF) front-ends in aerospace communications because of the\nexceptional electromechanical coupling (k^2) and frequency scalability.\nHowever, the properties of LWRs at cryogenic temperatures have not been well\nunderstood yet. Herein, we experimentally investigate the temperature\ndependence of the quality factor and resonant frequency in higher order\nantisymmetric LWRs down to millikelvin temperatures. The high-frequency A1 and\nA3 mode resonators with spurious-free responses are comprehensively designed,\nfabricated, and characterized. The quality factors of A1 modes gradually\nincrease upon cryogenic cooling and shows 4 times higher than the room\ntemperature value, while A3 mode resonators exhibit a non-monotonic temperature\ndependence. Our findings provide new insights into loss mechanisms of cryogenic\nLWRs, paving the way to strong-coupling quantum acoustodynamics and\nnext-generation satellite wireless communications.",
    "authors": [
      "Wenbing Jiang",
      "Xuankai Xu",
      "Jiazhen Pan",
      "Hancong Sun",
      "Yu Guo",
      "Huabing Wang",
      "Libing Zhou",
      "Tao Wu"
    ],
    "categories": [
      "physics.app-ph",
      "cond-mat.supr-con"
    ],
    "primary_category": "physics.app-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.10983v1",
    "entry_id": "http://arxiv.org/abs/2510.10983v1",
    "published": "2025-10-13T03:44:51+00:00",
    "updated": "2025-10-13T03:44:51+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10983v1.pdf"
  },
  {
    "id": "2510.11355v1",
    "title": "Nonequilibrium spin-splitter effect in altermagnet superconductor hybrids",
    "abstract": "We study the nonequilibrium spin-splitter effect in superconducting\naltermagnets and superconductor altermagnet hybrids by computing the\nalternating spin current and edge the spin density in the presence of an\nalternating electric field. We show that while in the normal state the effect\nis not sensitive to the field frequency, in the superconducting state, there is\na strong effect for frequencies on the scale of $\\Delta_0$ or lower. We\ncontrast the effect to the spin accumulation induced by the spin-Hall effect,\nby showing that for the altermagnet spin-splitter effect the out-of-phase spin\ndensity does not diverge in the adiabatic limit. This difference is attributed\nto the absence of any equilibrium spin-splitter effect in altermagnets. In\nfact, the out-of-phase component vanishes below the gap excitation frequency\n$2\\Delta_0$, because below this frequency the absence of dissipation and the\nbehavior of the system under time-reversal directly determine the relative\nphase between the charge current, spin current, and spin accumulation. The\nnonequilibrium effect can be tuned by external parameters like temperature. In\nfact, it has a nonmonotonic temperature dependence, taking its largest value\nfor temperatures around $0.8T_{c}$. The value at this temperature can be\nsignificantly larger than the normal state spin density or the low temperature\nspin density. Thus, besides using the nonequilibrium spin-splitter effect to\nidentify altermagnets, its tunability makes it also suitable for applications.",
    "authors": [
      "Tim Kokkeler",
      "Tero T. Heikkilä",
      "F. Sebastian Bergeret"
    ],
    "categories": [
      "cond-mat.supr-con"
    ],
    "primary_category": "cond-mat.supr-con",
    "pdf_url": "http://arxiv.org/pdf/2510.11355v1",
    "entry_id": "http://arxiv.org/abs/2510.11355v1",
    "published": "2025-10-13T12:49:51+00:00",
    "updated": "2025-10-13T12:49:51+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11355v1.pdf"
  },
  {
    "id": "2510.10835v1",
    "title": "Error thresholds of toric codes with transversal logical gates",
    "abstract": "The threshold theorem promises a path to fault-tolerant quantum computation\nby suppressing logical errors, provided the physical error rate is below a\ncritical threshold. While transversal gates offer an efficient method for\nimplementing logical operations, they risk spreading errors and potentially\nlowering this threshold compared to a static quantum memory. Available\nthreshold estimates for transversal circuits are empirically obtained and\nlimited to specific, sub-optimal decoders. To establish rigorous bounds on the\nnegative impact of error spreading by the transversal gates, we generalize the\nstatistical mechanical (stat-mech) mapping from quantum memories to logical\ncircuits. We establish a mapping for two toric code blocks that undergo a\ntransversal CNOT (tCNOT) gate. Using this mapping, we quantify the impact of\ntwo independent error-spreading mechanisms: the spread of physical bit-flip\nerrors and the spread of syndrome errors. In the former case, the stat-mech\nmodel is a 2D random Ashkin-Teller model. We use numerical simulation to show\nthat the tCNOT gate reduces the optimal bit-flip error threshold to $p=0.080$,\na $26\\%$ decrease from the toric code memory threshold $p=0.109$. The case of\nsyndrome error coexisting with bit-flip errors is mapped to a 3D random 4-body\nIsing model with a plane defect. There, we obtain a conservative estimate error\nthreshold of $p=0.028$, implying an even more modest reduction due to the\nspread of the syndrome error compared to the memory threshold $p=0.033$. Our\nwork establishes that an arbitrary transversal Clifford logical circuit can be\nmapped to a stat-mech model, and a rigorous threshold can be obtained\ncorrespondingly.",
    "authors": [
      "Yichen Xu",
      "Yiqing Zhou",
      "James P. Sethna",
      "Eun-Ah Kim"
    ],
    "categories": [
      "quant-ph",
      "cond-mat.dis-nn",
      "cond-mat.stat-mech",
      "cond-mat.str-el"
    ],
    "primary_category": "quant-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.10835v1",
    "entry_id": "http://arxiv.org/abs/2510.10835v1",
    "published": "2025-10-12T22:57:00+00:00",
    "updated": "2025-10-12T22:57:00+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10835v1.pdf"
  },
  {
    "id": "2510.10547v1",
    "title": "Near room temperature magnetoelectric response and tunable magnetic anisotropy in the two-dimensional magnet 1T-CrTe2",
    "abstract": "Magnets with controllable magnetization and high critical temperature are\nessential for practical spintronics devices, among which the two-dimensional\n1T-CrTe2 stands out because of its high experimental critical temperature up to\nabout 300K down to the single layer limit. By using ab initio density\nfunctional theory, we investigate the magnetic properties of monolayer and\nbilayer 1T-CrTe2 and demonstrate that the magnetic properties, such as the\nmagnetocrystalline anisotropy, critical Curie temperature and magnetizations,\ncan be influenced by strain or electric fields.",
    "authors": [
      "Fengping Li",
      "Bheema Lingam Chittari",
      "Chao Lei",
      "Jeil Jung"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "cond-mat.mes-hall"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10547v1",
    "entry_id": "http://arxiv.org/abs/2510.10547v1",
    "published": "2025-10-12T11:06:11+00:00",
    "updated": "2025-10-12T11:06:11+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10547v1.pdf"
  },
  {
    "id": "2510.12790v1",
    "title": "Thermodynamics of quantum processes: An operational framework for free energy and reversible athermality",
    "abstract": "We explore the thermodynamics of quantum processes (quantum channels) by\naxiomatically introducing the free energy for channels, defined via the quantum\nrelative entropy with an absolutely thermal channel whose fixed output is in\nequilibrium with a thermal reservoir. This definition finds strong support\nthrough its operational interpretations in designated quantum information and\nthermodynamic tasks. We construct a resource theory of athermality for quantum\nprocesses, where free operations are Gibbs preserving superchannels and golden\nunits are unitary channels with respect to absolutely thermal channel having\nfully degenerate output Hamiltonian. We exactly characterize the one-shot\ndistillation and formation of quantum channels using hypothesis-testing and\nmax-relative entropy with respect to the absolutely thermal channel. These\nrates converge asymptotically to the channel free energy (up to a\nmultiplicative factor of half the inverse temperature), establishing its\noperational meaning and proving the asymptotic reversibility of the\nathermality. We show the direct relation between the resource theory of\nathermality and quantum information tasks such as private randomness and purity\ndistillation and thermodynamic tasks of erasure and work extraction. Our work\nconnects the core thermodynamic concepts of free energy, energy, entropy, and\nmaximal extractable work of quantum processes to their information processing\ncapabilities.",
    "authors": [
      "Himanshu Badhani",
      "Dhanuja G S",
      "Siddhartha Das"
    ],
    "categories": [
      "quant-ph",
      "cond-mat.stat-mech",
      "hep-th",
      "math-ph",
      "math.MP"
    ],
    "primary_category": "quant-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.12790v1",
    "entry_id": "http://arxiv.org/abs/2510.12790v1",
    "published": "2025-10-14T17:58:01+00:00",
    "updated": "2025-10-14T17:58:01+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12790v1.pdf"
  },
  {
    "id": "2510.11603v1",
    "title": "Ab-initio calculation of magnetic exchange interactions using the spin-spiral method in VASP: Self-consistent versus magnetic force theorem approaches",
    "abstract": "We present an ab initio investigation of magnetic exchange interactions using\nthe spin-spiral method implemented in the VASP code, with a comparative\nanalysis of the self-consistent (SC) and magnetic force theorem (MFT)\napproaches. Using representative 3d ferromagnets (Fe, Co, Ni) and Mn-based full\nHeusler compounds, we compute magnon dispersion relations directly from\nspin-spiral total energies and extract real-space Heisenberg exchange\nparameters via Fourier transformation. Curie temperatures are subsequently\nestimated within both the mean-field and random-phase approximations. The SC\nspin-spiral calculations yield exchange parameters and magnon spectra in\nexcellent agreement with previous theoretical data, confirming their\nquantitative reliability across different classes of magnetic systems. In\ncontrast, the MFT approach exhibits systematic quantitative deviations: it\noverestimates spin-spiral energies and exchange couplings in high-moment\nsystems such as bcc Fe and the Mn-based Heuslers, while underestimating them in\nlow-moment fcc Ni. The magnitude of these discrepancies increases strongly with\nmagnetic moment size, exceeding several hundred percent in the high-moment\ncompounds. These findings underscore the decisive role of self-consistency in\naccurately determining magnetic exchange parameters and provide practical\nguidance for future first-principles studies of spin interactions and\nexcitations using the spin-spiral technique.",
    "authors": [
      "Umit Dogan Daglum",
      "Maria Stamenova",
      "Ersoy Sasioglu",
      "Stefano Sanvito"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.comp-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.11603v1",
    "entry_id": "http://arxiv.org/abs/2510.11603v1",
    "published": "2025-10-13T16:43:37+00:00",
    "updated": "2025-10-13T16:43:37+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11603v1.pdf"
  },
  {
    "id": "2510.11920v1",
    "title": "Low-field all-optical detection of superconductivity using NV nanodiamonds",
    "abstract": "Nitrogen-vacancy centers in nanodiamond offer a microwave-free, noninvasive\nplatform for probing superconductors via near zero-field cross-relaxation\nmagnetometry. We demonstrate this by depositing nanodiamonds on YBCO thin films\nto measure critical parameters: transition temperature and penetration field.\nThis method leverages nanodiamond fluorescence modulation as a result of\nmagnetic field variation with 1mT amplitude to observe the Meissner effect and\nfield scans to measure the penetration field. The approach is minimally\ninvasive and can be applied to superconducting samples with rough surfaces,\nfacilitating the study of flux vortices and critical phenomena in complex\ngeometries.",
    "authors": [
      "Omkar Dhungel",
      "Saravanan Sengottuvel",
      "Mariusz Mrozek",
      "Till Lenz",
      "Nir Bar-Gill",
      "Adam M. Wojciechowski",
      "Arne Wickenbrock",
      "Dmitry Budker"
    ],
    "categories": [
      "cond-mat.supr-con",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.supr-con",
    "pdf_url": "http://arxiv.org/pdf/2510.11920v1",
    "entry_id": "http://arxiv.org/abs/2510.11920v1",
    "published": "2025-10-13T20:41:33+00:00",
    "updated": "2025-10-13T20:41:33+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11920v1.pdf"
  },
  {
    "id": "2510.11864v1",
    "title": "Dipole-quadrupole model and multipole analysis of resonant membrane metasurfaces",
    "abstract": "Membrane-metasurfaces, formed by periodic arrangements of holes in a\ndielectric layer, are gaining attention for their easier manufacturing via\nsubtractive techniques, unnecessity of substrates, and access to resonant\nnear-fields. Despite their practical relevance, their theoretical description\nremains elusive. Here, we present a semi-analytical dipole-quadrupole model for\nthe multipole analysis of numerically-obtained reflection and transmission\nspectra in metasurfaces excited at arbitrary angles. Dipole models are\ngenerally sufficient to study traditional metasurfaces made of solid\nnanostructures. However, the inclusion of electric and magnetic quadrupoles is\nnecessary to study membrane-metasurfaces, which offer an ideal platform to\nshowcase our method. We demonstrate the importance of choosing the optimal\nposition of a symmetric membrane-metasurface's unit cell to ensure the\nsufficiency of the dipole-quadrupole approximation. We show that our formalism\ncan explain complex phenomena arising from inter-multipole interference,\nincluding lattice anapole and generalized Kerker effects, Fano resonances, and\nquasi-bound states in the continuum. We also present the applicability of the\nmethod to membrane-metasurfaces with non-centrosymmetric unit cells (e.g.,\nconical holes and surface voids). By enabling a deeper insight into the\ncoupling mechanisms leading to the formation of local and collective\nresonances, our method expands the electromagnetics toolbox to study,\nunderstand, and design conventional and membrane-metasurfaces.",
    "authors": [
      "Izzatjon Allayarov",
      "Andrey B. Evlyukhin",
      "Antonio Calà Lesina"
    ],
    "categories": [
      "physics.optics",
      "cond-mat.mes-hall"
    ],
    "primary_category": "physics.optics",
    "pdf_url": "http://arxiv.org/pdf/2510.11864v1",
    "entry_id": "http://arxiv.org/abs/2510.11864v1",
    "published": "2025-10-13T19:18:30+00:00",
    "updated": "2025-10-13T19:18:30+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11864v1.pdf"
  },
  {
    "id": "2510.10435v1",
    "title": "Proof of the exact diffusion constant via first passage time in quasi-periodic potentials",
    "abstract": "Brownian motion in terms of Lifson and Jackson (LJ) formula has been widely\nexplored in periodic systems and it has been believed for a long time that the\nLJ formula only applies to periodic potentials. Recently we show that for the\nfollowing Brownian motion $\\gamma \\dot{x} = -U'(x) + \\xi$, where $U(x)$ is the\nquasi-periodic potential, the effective diffusion constant can still be\ndescribed by the LJ formula $D^* = D/(\\langle \\exp(\\beta U)\\rangle \\langle\n\\exp(-\\beta U)\\rangle)$, where the average is redefined as $\\langle \\exp(\\beta\nU)\\rangle = \\lim_{L\\rightarrow \\infty} L^{-1} \\int_0^L \\exp(\\beta U(x))dx$. In\nthis manuscript we prove this result exactly using the mean first passage time\n$\\tau(x)$, with boundary conditions $\\tau(\\pm L) = 0$, and show that the\neffective diffusion constant can be determined using $D^* =\\lim_{L \\rightarrow\n\\infty} L^2/(2\\tau(0))$, where $\\pm L$ is the two positions of the absorbing\nboundary. We exactly solve the equation of motion of $\\tau(x)$ and obtain the\nabove result with the aid of Jacobi-Anger expansion method. Our result can be\ngeneralized to the other potentials and even higher dimensions, which can\ngreatly broaden our understanding of Brownian motion in more general\ncircumstances. The requirement for a well-defined effective diffusion constant\n$D^*$ in more general potentials is also discussed.",
    "authors": [
      "Ming Gong"
    ],
    "categories": [
      "cond-mat.stat-mech"
    ],
    "primary_category": "cond-mat.stat-mech",
    "pdf_url": "http://arxiv.org/pdf/2510.10435v1",
    "entry_id": "http://arxiv.org/abs/2510.10435v1",
    "published": "2025-10-12T03:58:41+00:00",
    "updated": "2025-10-12T03:58:41+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10435v1.pdf"
  },
  {
    "id": "2510.10745v1",
    "title": "Fluidity and morphological stability of an amorphous thin film with radiation-induced defect kinetics",
    "abstract": "It is common to model ion-irradiated amorphous thin films as if they were\nhighly viscous fluids. In such models, one is frequently concerned with the\nion-enhanced fluidity, a measure of the ability of the free interface to relax\nsurface energy. Motivated by usual fluid dynamics problems, the ion-enhanced\nfluidity is near-universally treated as a constant throughout the amorphous\nlayer. However, for an irradiated thin film, the fluidity is ultimately caused\nby radiation-induced defect kinetics within the film, leading to regions with\ngreater or lesser fluidity, and sensitive dependence on ion energy, species,\nflux, irradiation angle, temperature, and other experimental parameters. Here,\nwe develop and analyze a model of radiation-induced defect kinetics coupled to\nthe continuum equations of a viscous thin film. Using realistic parameter\nvalues, we show that defect kinetics can meaningfully alter theoretical\npredictions of surface relaxation and ion-enhanced fluidity. Implications for\naligning theoretical and experimental work, especially for surface\nnano-patterning of silicon induced by low-energy argon irradiation, are\ndiscussed.",
    "authors": [
      "Tyler P. Evans",
      "Eden Heyen"
    ],
    "categories": [
      "cond-mat.soft",
      "cond-mat.mes-hall",
      "nlin.PS"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.10745v1",
    "entry_id": "http://arxiv.org/abs/2510.10745v1",
    "published": "2025-10-12T18:32:09+00:00",
    "updated": "2025-10-12T18:32:09+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10745v1.pdf"
  },
  {
    "id": "2510.10298v1",
    "title": "Defect-driven incoherent skin localization",
    "abstract": "The process of dephasing during wave evolution has traditionally been viewed\nas an obstacle to localization, leading to diffusion even in strongly\ndisordered Hermitian lattices. In contrast, here we demonstrate how the\ninterplay of dephasing with non-Hermitian defects can be harnessed to engineer\nwave localization. Specifically, we identify a novel dynamical localization\nphenomenon characterized by wavefunction accumulation at the lattice's boundary\ndue solely to dephasing, despite globally reciprocal couplings. Furthermore, we\nstudy the incoherent skin effect arising from coupling asymmetry, and\ninvestigate the interplay between these antagonistic localization mechanisms.\nBy reframing dephasing from a hindrance into a tool, this study overturns\nestablished paradigms of wave localization and paves the way for novel\napproaches to controlling localization phenomena in non-Hermitian physics.",
    "authors": [
      "Emmanouil T. Kokkinakis",
      "Konstantinos G. Makris",
      "Eleftherios N. Economou"
    ],
    "categories": [
      "cond-mat.dis-nn",
      "physics.optics",
      "quant-ph"
    ],
    "primary_category": "cond-mat.dis-nn",
    "pdf_url": "http://arxiv.org/pdf/2510.10298v1",
    "entry_id": "http://arxiv.org/abs/2510.10298v1",
    "published": "2025-10-11T17:45:41+00:00",
    "updated": "2025-10-11T17:45:41+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10298v1.pdf"
  },
  {
    "id": "2510.09900v1",
    "title": "Hydration Free Energies of Linear Alkanes: Evaluating and Correcting Classical Force Field Predictions with Different Water Models",
    "abstract": "Common force fields tend to overestimate the hydration free energies of\nhydrophobic solutes, leading to an exaggerated hydrophobic effect. We compute\nthe hydration free energies of linear alkanes from methane to eicosane\n(C$_{20}$H$_{42}$) using free energy perturbation with various three-site\n(SPC/E, OPC3) and four-site (TIP4P/2005, OPC) water models and the TraPPE-UA\nforce field for alkanes. All water models overestimate the hydration free\nenergies, though the four-site models perform better than the three-site ones.\nBy utilizing cavity free energies, we reparameterize the alkane--water well\ndepth to bring simulation results in agreement with experimental and\ngroup-contribution estimates. We find that the General Amber Force Field (GAFF)\ncombined with TIP4P/2005 water provides closer estimates of the hydration free\nenergy. The HH alkane model (a reparameterized TraPPE-UA force field) with\nTIP4P/2005 reproduces experimental hydration free energies. We also show that\napplying a shifted Lennard--Jones potential leads to systematic deviations in\nthe hydration free energy estimates.",
    "authors": [
      "Yalda Ramezani",
      "Sumit Sharma"
    ],
    "categories": [
      "cond-mat.soft"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.09900v1",
    "entry_id": "http://arxiv.org/abs/2510.09900v1",
    "published": "2025-10-10T22:24:53+00:00",
    "updated": "2025-10-10T22:24:53+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.09900v1.pdf"
  },
  {
    "id": "2510.10309v1",
    "title": "Roles of Electrically Excited Magnons in Unidirectional Magnetoresistance of Metallic Magnetic Bilayers",
    "abstract": "Unidirectional magnetoresistance (UMR) in metallic bilayers arises from\nnonlinear spin-charge transport mediated by broken time-reversal and inversion\nsymmetries, yet the role of magnons remains unsettled. We develop a theoretical\nframework that incorporates coupled electron-magnon dynamics, revealing cross\ndiffusion and spin-angular-momentum transfer between the two subsystems, which\nrenormalize the characteristic electron and magnon spin-diffusion lengths. We\nshow that nonequilibrium magnons, indirectly excited by the electric field, can\nsuppress UMR by absorbing spin angular momentum from conduction electrons. We\nalso analyze the magnetic-field, thickness, and temperature dependencies and\nidentify distinct features that constitute experimental fingerprints of\nmagnonic contributions to UMR in metallic bilayers, providing qualitative to\nsemiquantitative guidance for elucidating the underlying physical mechanisms.",
    "authors": [
      "Shashank Gupta",
      "Steven S. -L. Zhang"
    ],
    "categories": [
      "cond-mat.mes-hall"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.10309v1",
    "entry_id": "http://arxiv.org/abs/2510.10309v1",
    "published": "2025-10-11T18:28:52+00:00",
    "updated": "2025-10-11T18:28:52+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10309v1.pdf"
  },
  {
    "id": "2510.10566v1",
    "title": "Uniformity Bias in Ground-State Sampling Induced by Replica Alignment in Quantum Monte Carlo for Quantum Annealing",
    "abstract": "Quantum annealing (QA) with a transverse field often fails to sample\ndegenerate ground states fairly, limiting applicability to problems requiring\ndiverse optimal solutions. Although Quantum Monte Carlo (QMC) is widely used to\nsimulate QA, its ability to reproduce such unfair ground-state sampling remains\nunclear because stochastic and coherent quantum dynamics differ fundamentally.\nWe quantitatively evaluate how accurately QMC reproduces the sampling bias in\nQA by comparing the final ground-state distributions from the QMC master\nequation and the Schr\\\"odinger equation. We find QMC tends to produce uniform\nground-state probabilities, unlike QA's biased distribution, and that this\nuniformity bias strengthens as annealing proceeds. Our analysis reveals that\nthis bias originates from replica alignment -- the dominance of configurations\nin which all Trotter replicas coincide -- caused by the energetic suppression\nand entropic reduction of kink configurations (replica mismatches). These\nfindings clarify a fundamental limitation of discrete-time QMC in faithfully\nsimulating QA dynamics, highlighting the importance of replica correlations and\ntransition rules in achieving realistic ground-state sampling.",
    "authors": [
      "Naoki Maruyama",
      "Masayuki Ohzeki",
      "Kazuyuki Tanaka"
    ],
    "categories": [
      "quant-ph",
      "cond-mat.stat-mech"
    ],
    "primary_category": "quant-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.10566v1",
    "entry_id": "http://arxiv.org/abs/2510.10566v1",
    "published": "2025-10-12T12:23:12+00:00",
    "updated": "2025-10-12T12:23:12+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10566v1.pdf"
  },
  {
    "id": "2510.11337v1",
    "title": "Behavior of passive polymeric tracers of different topologies in a dilute bath of active Brownian particles",
    "abstract": "Using computer simulations in two dimensions we investigate the dynamics and\nstructure of passive polymeric tracer with different topologies immersed in a\nlow-density active particle bath. One of the key observations is that polymer\nexhibit faster dynamics compared to passive colloidal particles at high\nactivity, for the same particle density, in both linear and star polymer\ntopologies. This enhanced motion is attributed to the accumulation of active\nparticles, which induces prolonged and persistent movement of the polymer.\nFurther analysis reveals that star polymers exhibit more complex and intriguing\nbehavior than their linear counterparts. Notably, the accumulation of active\nparticles promotes the pairing of arms in star polymers. For instance, a\nthree-armed star polymer adopts a conformation similar to a linear polymer with\ntwo-arms due to this pairing as a result, at high activity, the dynamics of\nboth the polymers converge. Finally, we explore the dynamics of a linear\npolymer with the same total number of beads as the star polymer. Interestingly,\nat high activity -- where arm pairing in the star polymer is significant -- the\nstar polymer demonstrates faster dynamics than the linear polymer, despite\nhaving the identical number of beads. These findings contribute to a broader\nunderstanding of the interactions between active and passive components of\nvarying topologies in dilute systems and highlight their potential for\ninnovative applications ranging from materials science to biomedicine.",
    "authors": [
      "Ramanand Singh Yadav",
      "Ralf Metzler",
      "Rajarshi Chakrabarti"
    ],
    "categories": [
      "cond-mat.soft",
      "cond-mat.stat-mech",
      "physics.bio-ph"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.11337v1",
    "entry_id": "http://arxiv.org/abs/2510.11337v1",
    "published": "2025-10-13T12:31:03+00:00",
    "updated": "2025-10-13T12:31:03+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11337v1.pdf"
  },
  {
    "id": "2510.09807v1",
    "title": "Rotation of crystal seed during early stages of growth reveals the anisotropy of glass matrix",
    "abstract": "Rotation of crystal seed during the early stages of growth in a glass matrix\nhas been observed due to some torque, contradicting the expectations from the\nisotropic, uniform structure of the surrounding amorphous matrix. We establish\nan atomistic origin of this new phenomenon from molecular dynamics simulations\nusing LiNbO3 and LiNbO3-SiO2 glasses as model systems. Effectively, it arises\ndue to non-uniform forces on the seed from the surrounding glass, which appears\ninhomogeneous and anisotropic on the scale of glass-crystal interface. The\nseeded crystal growth (SCG) at higher temperatures amplifies this effect due to\nenhanced atomic dynamics. Silica, when added to LiNbO3 glass, reduces the\ncrystal growth rate due to increased viscosity and restricted atomic mobility\nacross the growth interface, but has minimal effect on the crystal rotation.\nThese findings challenge a general assumption that glass is an isotropic\nmaterial, especially during the early stage of its crystallization, and provide\ninsights for tailoring the microstructure of widely used glass-ceramics.",
    "authors": [
      "R. Thapa",
      "E. Mustermann",
      "H. Jain",
      "V. Dierolf",
      "M. E. McKenzie"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.09807v1",
    "entry_id": "http://arxiv.org/abs/2510.09807v1",
    "published": "2025-10-10T19:06:56+00:00",
    "updated": "2025-10-10T19:06:56+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.09807v1.pdf"
  },
  {
    "id": "2510.12593v1",
    "title": "Escape-Induced Temporally Correlated Noise Driven Universality Crossover",
    "abstract": "Universal behavior in far-from-equilibrium systems is driven by interactions\nbetween transport processes and noise structure. The Kardar-Parisi-Zhang (KPZ)\nframework predicts that extensions incorporating conserved currents or\ntemporally correlated noise give rise to distinct growth morphologies and\nuniversality classes, yet direct experimental realization has remained elusive.\nHere, we report atomically resolved Sn thin-film growth on Sb-doped\nMnBi$_2$Te$_4$, revealing a sharp dynamical crossover between two fundamentally\ndifferent regimes. Early stage growth follows conserved KPZ scaling, forming\ntwo-dimensional islands and stanene layers. Beyond a critical deposition time,\ntemporally correlated noise dominates, driving the nucleation of $\\alpha$ -Sn\nclusters, their evolution into faceted grains, and coexistence with faceted\n$\\beta$-Sn. Molecular dynamics simulation and Auger electron spectroscopy show\nadatom escape as the microscopic origin of temporally correlated noise,\nproviding a microscopic mechanism for the universality crossover. These\nfindings establish, for the first time, that temporal noise correlations can\nfundamentally alter the scaling class of a growing interface, linking atomistic\nkinetics to emergent universal behavior.",
    "authors": [
      "Mrinal Manna",
      "Sourav Mukherjee",
      "Soumen Giri",
      "Pramod Bhakuni",
      "Sajal Barman",
      "Arnab Kumar Pariari",
      "Anil Gome",
      "Markus Hucker",
      "V. Raghavendra Reddy",
      "Anupam Roy",
      "Sudipta Roy Barman",
      "Smarajit Karmakar",
      "Chandana Mondal",
      "Rajib Batabyal"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.12593v1",
    "entry_id": "http://arxiv.org/abs/2510.12593v1",
    "published": "2025-10-14T14:48:06+00:00",
    "updated": "2025-10-14T14:48:06+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12593v1.pdf"
  },
  {
    "id": "2510.12359v1",
    "title": "Interlayer coupling enhanced superconductivity near 100 K in La$_{3-x}$Nd$_x$Ni$_2$O$_7$",
    "abstract": "Systematically controlling the superconducting transition temperature\n($T_\\text{c}$) in the bilayer Ruddlesden-Popper nickelate La$_3$Ni$_2$O$_7$\nremains a significant challenge. Here, we address this by synthesizing\nhigh-quality polycrystalline La$_{3-x}$Nd$_x$Ni$_2$O$_7$ ($0 \\leq x \\leq 2.4$)\nwith record-level rare-earth substitution. Nd doping compresses the lattice,\nparticularly along the $c$ axis, enhances the spin density wave transition\ntemperature, and elevates the pressure required for the\northorhombic-to-tetragonal structural transition. Superconductivity is observed\nacross all doping levels under high pressures, with the onset $T_\\text{c}$\nrising to $\\sim$93~K for $x = 2.1$ and $2.4$ from the electronic transport\nmeasurement. Using the radio-frequency transmission technique, newly applied to\nnickelate superconductors, we detect signatures of superconductivity at $98 \\pm\n2$~K in the $x=2.4$ compound, pushing the $T_\\text{c}$ frontier further. We\nidentify a universal linear relationship where $T_\\text{c}$ decreases with the\n$c$-axis lattice parameter at a rate of approximately $-28$~K/\\AA,\ndemonstrating that enhanced interlayer magnetic exchange coupling is the\ndominant mechanism for superconducting pairing. Our work establishes the\ncritical role of magnetism and provides a unified structural descriptor for\nelevating $T_\\text{c}$ in bilayer nickelates.",
    "authors": [
      "Zhengyang Qiu",
      "Junfeng Chen",
      "Dmitrii V. Semenok",
      "Qingyi Zhong",
      "Di Zhou",
      "Jingyuan Li",
      "Peiyue Ma",
      "Xing Huang",
      "Mengwu Huo",
      "Tao Xie",
      "Xiang Chen",
      "Ho-kwang Mao",
      "Viktor Struzhkin",
      "Hualei Sun",
      "Meng Wang"
    ],
    "categories": [
      "cond-mat.supr-con"
    ],
    "primary_category": "cond-mat.supr-con",
    "pdf_url": "http://arxiv.org/pdf/2510.12359v1",
    "entry_id": "http://arxiv.org/abs/2510.12359v1",
    "published": "2025-10-14T10:23:35+00:00",
    "updated": "2025-10-14T10:23:35+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12359v1.pdf"
  },
  {
    "id": "2510.12405v1",
    "title": "Continuous Uniqueness and Novelty Metrics for Generative Modeling of Inorganic Crystals",
    "abstract": "To address pressing scientific challenges such as climate change,\nincreasingly sophisticated generative artificial intelligence models are being\ndeveloped that can efficiently sample the large chemical space of possible\nfunctional materials. These models can quickly sample new chemical compositions\npaired with crystal structures. They are typically evaluated using uniqueness\nand novelty metrics, which depend on a chosen crystal distance function.\nHowever, the most prevalent distance function has four limitations: it fails to\nquantify the degree of similarity between compounds, cannot distinguish\ncompositional difference and structural difference, lacks Lipschitz continuity\nagainst shifts in atomic coordinates, and results in a uniqueness metric that\nis not invariant against the permutation of generated samples. In this work, we\npropose using two continuous distance functions to evaluate uniqueness and\nnovelty, which theoretically overcome these limitations. Our experiments show\nthat these distances reveal insights missed by traditional distance functions,\nproviding a more reliable basis for evaluating and comparing generative models\nfor inorganic crystals.",
    "authors": [
      "Masahiro Negishi",
      "Hyunsoo Park",
      "Kinga O. Mastej",
      "Aron Walsh"
    ],
    "categories": [
      "cs.LG",
      "cond-mat.mtrl-sci",
      "68T07",
      "J.2; I.2.0"
    ],
    "primary_category": "cs.LG",
    "pdf_url": "http://arxiv.org/pdf/2510.12405v1",
    "entry_id": "http://arxiv.org/abs/2510.12405v1",
    "published": "2025-10-14T11:38:21+00:00",
    "updated": "2025-10-14T11:38:21+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12405v1.pdf"
  },
  {
    "id": "2510.11342v1",
    "title": "One-dimensional topological superconductors with nonsymmorphic symmetries",
    "abstract": "We present example four-band Hermitian tight-binding Bogoliubov-de-Gennes\n(BdG) Hamiltonians and Kramer's degenerate Hamiltonians in one dimension.\nStarting from a generalized Rice-Mele model, we incorporate superconducting\nterms to obtain a four-band BdG Hamiltonian with intrinsic charge-conjugation\nsymmetry, and constrain it using symmorphic or nonsymmorphic time-reversal\nsymmetries. In position space we find that each form of time-reversal symmetry,\nwhen applied to random BdG matrices, results in a unique block diagonalization\nof the Hamiltonian when translational symmetry is also enforced. We provide\nrepresentative models in all relevant symmorphic symmetry classes, including\nthe non-superconducting CII class. For nonsymmorphic time-reversal symmetry, we\nidentify a $\\mathbb{Z}_4$ topological index with two phases supporting Majorana\nzero modes and two without, and study disorder effects in the presence of\ntopological solitons. We further generalize a winding-number method, previously\napplied only to $\\mathbb{Z}_2$ invariants without Kramer's degeneracy, to\ncompute indices for both the $\\mathbb{Z}_4$ model and a non-superconducting AII\nmodel with nonsymmorphic chiral symmetry and Kramer's degeneracy. We propose\ntopolectric circuit implementations of the charge-density-wave and\n$\\mathbb{Z}_4$ models which agree with the topological calculations. Finally,\nwe show that, in one dimension, nonsymmorphic unitary symmetries do not produce\nnew topological classifications beyond $\\mathbb{Z}$ or $\\mathbb{Z}_2$ indices.",
    "authors": [
      "Max Tymczyszyn",
      "Edward McCann"
    ],
    "categories": [
      "cond-mat.mes-hall"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.11342v1",
    "entry_id": "http://arxiv.org/abs/2510.11342v1",
    "published": "2025-10-13T12:38:25+00:00",
    "updated": "2025-10-13T12:38:25+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11342v1.pdf"
  },
  {
    "id": "2510.10050v1",
    "title": "Quantum many-body analysis of a spin-2 bosons with two-body inelastic decay",
    "abstract": "Bose-Einstein condensates (BECs) of $^{87}\\textrm{Rb}$ atoms with a hyperfine\nspin of 2 are open quantum systems, where the atoms are lost through two-body\ninelastic collisions. In this dissipation process, a collision channel with\ntotal spin of 4 is forbidden by angular momentum conservation, which results in\nmagnetization of the atoms remaining in the condensate. Here, we investigate\nthe quantum many-body properties of spin-2 bosons that undergo two-body atomic\nloss. We show that the system finally reaches a steady state, which is a\nmixture of the states with maximum total spins. In addition, we find that a\nnon-classical steady state can be obtained by quenching the quadratic Zeeman\ncoefficient.",
    "authors": [
      "Takeshi Takahashi",
      "Hiroki Saito"
    ],
    "categories": [
      "cond-mat.quant-gas"
    ],
    "primary_category": "cond-mat.quant-gas",
    "pdf_url": "http://arxiv.org/pdf/2510.10050v1",
    "entry_id": "http://arxiv.org/abs/2510.10050v1",
    "published": "2025-10-11T06:33:25+00:00",
    "updated": "2025-10-11T06:33:25+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10050v1.pdf"
  },
  {
    "id": "2510.10064v1",
    "title": "Broad nonlocal spectrum in the Pb-InSb hybrid three terminals for potential realization of Kitaev chains",
    "abstract": "Hybrid superconductor-semiconductor(SC-SM) nanowires remain one of the\nforemost platforms for engineering topological superconductivity and Majorana\nzero modes(MZMs) towards fault-tolerant topological qubits, especially with the\nrapid development of artificial Kitaev chains. In contrast to the widely used\naluminum(Al)-based hybrids, lead(Pb) offers a bulk superconducting gap of\n~1.4meV and a critical temperature of ~7.2K, giving rise to a proximity-induced\ngap that is roughly five times larger than that obtained with Al. Here we\npresent the first three-terminal Pb-hybrid devices and perform nonlocal\ndifferential-conductance spectroscopy on this platform. The nonlocal\nmeasurement simultaneously resolves a dual-gap feature of the parent Pb gap and\nthe large, hard, gate-tunable induced superconducting gap, distinguished by a\nswitch between electron- and hole-like dissipation processes. Within the\ninduced gap we observe several types of Andreev bound states(ABSs) that undergo\nsinglet-doublet transitions. Moreover, by tuning gate voltages we achieve\ngate-controlled resonating sign reversals of the nonlocal conductance,\nidentifying three distinct regimes that correspond to different configurations\nof quantum-dot(QD) resonances(single-resonance, double-resonance, and\nseries-resonance). Finally, the coupling between ABSs and QDs also present and\ncan be modulated from the weak- to strong-coupling limit, indicating the\nfeasibility of realizing the artificial Kitaev chains. Crucially, the robust\nnonlocal signatures persist up to temperatures(~1K) far above the operating\ntemperature of Al-based devices thanks to the unusually large induced gap,\nthereby widening the accessible parameter space greatly and underscoring the\nsuitability of Pb-based hybrids for implementing warm temperature artificial\nKitaev chains and the topological quantum devices protected by a substantially\nlarger topological gap.",
    "authors": [
      "Guoan Li",
      "Xiaofan Shi",
      "Ruixuan Zhang",
      "Yuxiao Song",
      "Marco Rossi",
      "Ghada Badawy",
      "Zhiyuan Zhang",
      "Anqi Wang",
      "Xingchen Guo",
      "Xiao Deng",
      "Xiao Chen",
      "Liangqian Xu",
      "Bingbing Tong",
      "Peiling Li",
      "Xiaohui Song",
      "Zhaozheng Lyu",
      "Guangtong Liu",
      "Fanming Qu",
      "Michał P. Nowak",
      "Paweł Wójcik",
      "Ziwei Dou",
      "Erik P. A. M. Bakkers",
      "Li Lu",
      "Jie Shen"
    ],
    "categories": [
      "quant-ph",
      "cond-mat.mes-hall",
      "cond-mat.supr-con"
    ],
    "primary_category": "quant-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.10064v1",
    "entry_id": "http://arxiv.org/abs/2510.10064v1",
    "published": "2025-10-11T06:59:39+00:00",
    "updated": "2025-10-11T06:59:39+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10064v1.pdf"
  },
  {
    "id": "2510.10743v1",
    "title": "Unveiling the growth mode diagram of GaSe on sapphire",
    "abstract": "The growth of two-dimensional epitaxial materials on industrially relevant\nsubstrates is critical for enabling their scalable synthesis and integration\ninto next-generation technologies. Here we present a comprehensive study of the\nmolecular beam epitaxial growth of gallium selenide on 2-inch c-plane sapphire\nsubstrates. Using in-situ reflection high-energy electron diffraction (RHEED),\nin-situ Raman spectroscopy, optical and scanning electron microscopies, we\nconstruct a diagram of the gallium selenide growth modes as a function of\nsubstrate temperature (530-650 {\\deg}C) and Se/Ga flux ratio (5-110). The\ngrowth mode diagram reveals distinct regimes, including the growth of layered\npost-transition metal monochalcogenide GaSe with an unstrained in-plane lattice\nconstant of 0.371$\\pm$0.001 nm and a partial epitaxial alignment on sapphire.\nThis work demonstrates a RHEED-based pathway for synthesizing gallium selenide\nof specific phase and morphology, and the construction of a phase diagram for\nhigh vapor pressure III-VI compounds that can be applied to a wide range of\nother metal chalcogenide materials.",
    "authors": [
      "M. Bissolo",
      "M. Dembecki",
      "J. Belz",
      "J. Schabesberger",
      "M. Bergmann",
      "P. Avdienko",
      "F. Rauscher",
      "A. S. Ulhe",
      "H. Riedl",
      "K. Volz",
      "J. J. Finley",
      "E. Zallo",
      "G. Koblmüller"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10743v1",
    "entry_id": "http://arxiv.org/abs/2510.10743v1",
    "published": "2025-10-12T18:29:39+00:00",
    "updated": "2025-10-12T18:29:39+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10743v1.pdf"
  },
  {
    "id": "2510.10723v1",
    "title": "Approach to zigzag and checkerboard patterns in spatially extended systems",
    "abstract": "Zigzag patterns in one dimension or checkerboard patterns in two dimensions\noccur in a variety of pattern-forming systems. We introduce an order parameter\n`phase defect' to identify this transition and help to recognize the associated\nuniversality class on a discrete lattice. In one dimension, if $x_{i}(t)$ is a\nvariable value at site $i$ at time $t$. We assign spin $s_i(t)=1$ for\n$x_{i}(t)>x_{i-1}(t)$, $s_i(t)=-1$ if $x_{i}(t)<x_{i-1}(t)$, and $s_i(t)=0$ if\n$x_{i}(t)=x_{i-1}(t)$. The phase defect $D(t)$ is defined as\n$D(t)={\\frac{\\sum_{i=1}^N \\vert s_i(t)+s_{i-1}(t)\\vert} {2N}}$ for a lattice of\n$N$ sites with periodic boundary conditions. It is zero for a zigzag pattern.\nIn two dimensions, $D(t)$ is the sum of row-wise as well as column-wise phase\ndefects and is zero for the checkerboard pattern. The persistence $P(t)$ is the\nfraction of sites whose spin value did not change even once till time $t$. We\nfind that $D(t)\\sim t^{-\\delta}$ and $P(t)\\sim t^{-\\theta}$ for the parameter\nrange over which the zigzag or checkerboard pattern is realized. We observe\nthat $\\delta=0.5$ and $\\theta=3/8$ for 1-d coupled logistic maps or Gauss maps,\nand $\\theta=0.22$ and $\\delta=0.45$ in 2-d logistic or Gauss maps. The exponent\n$\\theta$ matches with the persistence exponent at zero temperature for the\nIsing model, and $\\delta$ matches with the exponent for the Ising model at the\ncritical temperature. This power-law decay is observed over a range of\nparameter values and not just critical point.",
    "authors": [
      "Manoj C. Warambhe",
      "Prashant M. Gade"
    ],
    "categories": [
      "cond-mat.stat-mech"
    ],
    "primary_category": "cond-mat.stat-mech",
    "pdf_url": "http://arxiv.org/pdf/2510.10723v1",
    "entry_id": "http://arxiv.org/abs/2510.10723v1",
    "published": "2025-10-12T17:55:56+00:00",
    "updated": "2025-10-12T17:55:56+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10723v1.pdf"
  },
  {
    "id": "2510.10928v1",
    "title": "Impact of elastic inhomogeneity on collective dynamical properties investigated by field theoretical description in real space",
    "abstract": "Interpreting the vibrational properties of amorphous solids beyond Debye's\ntheory is challenging due to the presence of inhomogeneity on the mesoscopic\nscale. In this work, we model this inhomogeneity by real-space fluctuating\nelasticity with a spatially correlated distribution and calculate the dynamical\nproperties using an exact real-space field theoretical approach. Our results\nclarify that the excess low-frequency density of states (DOS) originates from a\nselective scattering effect (stronger scattering of short wavelengths) induced\nby elastic inhomogeneity. The visualization of the local DOS in real space\nreveals the existence of anomalous modes, highly excited spots, at low\nfrequencies. The findings regarding these highly excited spots and the\nselectivity of the correlation length were missed in previous perturbative\nfield approaches in wave-vector space, and they align with recent progress from\nparticle-level simulations and experiments. These results provide concrete\ninsights into the low-frequency vibrational anomaly of amorphous solids from\nthe perspective of simple elastic inhomogeneity.",
    "authors": [
      "Cunyuan Jiang"
    ],
    "categories": [
      "cond-mat.soft"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.10928v1",
    "entry_id": "http://arxiv.org/abs/2510.10928v1",
    "published": "2025-10-13T02:43:02+00:00",
    "updated": "2025-10-13T02:43:02+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10928v1.pdf"
  },
  {
    "id": "2510.12580v1",
    "title": "Anonymous leadership and stochastic resonance in collectives of self-propelled robots",
    "abstract": "We investigate the influence of an anonymous leader on a collective of\nself-propelled robots using Kilobot experiments and numerical simulations. A\nsingle leader alternated deterministically between clockwise and\ncounterclockwise motion, while the other robots followed a stochastic majority\nrule. Although the leader does not change global order, it induces correlations\nwith the collective response that peak at intermediate perturbation levels,\nresembling stochastic resonance. Simulations confirm that this resonance occurs\nwhen the leader's reversal period matches the mean residence time of the\nunperturbed system. Our results contribute to understanding decision-making in\nactive matter and suggesting principles for steering robotic swarms with\nminimal leadership input.",
    "authors": [
      "Manuel Dizenhaus",
      "Franco De Simone",
      "German A. Patterson"
    ],
    "categories": [
      "cond-mat.soft",
      "cond-mat.other"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.12580v1",
    "entry_id": "http://arxiv.org/abs/2510.12580v1",
    "published": "2025-10-14T14:39:03+00:00",
    "updated": "2025-10-14T14:39:03+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12580v1.pdf"
  },
  {
    "id": "2510.12443v1",
    "title": "Self-attention enabled quantum path analysis of high-harmonic generation in solids",
    "abstract": "High-harmonic generation (HHG) in solids provides a powerful platform to\nprobe ultrafast electron dynamics and interband--intraband coupling. However,\ndisentangling the complex many-body contributions in the HHG spectrum remains\nchallenging. Here we introduce a machine-learning approach based on a\nTransformer encoder to analyze and reconstruct HHG signals computed from a\none-dimensional Kronig--Penney model. The self-attention mechanism inherently\nhighlights correlations between temporal dipole dynamics and high-frequency\nspectral components, allowing us to identify signatures of nonadiabatic band\ncoupling that are otherwise obscured in standard Fourier analysis. By combining\nattention maps with Gabor time--frequency analysis, we extract and amplify weak\ncoupling channels that contribute to even-order harmonics and anomalous\nspectral features. Our results demonstrate that multi-head self-attention acts\nas a selective filter for strong-coupling events in the time domain, enabling a\nphysics-informed interpretation of high-dimensional quantum dynamics. This work\nestablishes Transformer-based attention as a versatile tool for solid-state\nstrong-field physics, opening new possibilities for interpretable machine\nlearning in attosecond spectroscopy and nonlinear photonics.",
    "authors": [
      "Cong Zhao",
      "Xiaozhou Zou"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.comp-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.12443v1",
    "entry_id": "http://arxiv.org/abs/2510.12443v1",
    "published": "2025-10-14T12:25:00+00:00",
    "updated": "2025-10-14T12:25:00+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12443v1.pdf"
  },
  {
    "id": "2510.11601v1",
    "title": "Quantum Synchronization of Perturbed Oscillating Coherences",
    "abstract": "Synchronization in quantum systems has been recently studied through\npersistent oscillations of local observables, which stem from undamped modes of\nthe dissipative dynamics. However, the existence of such modes requires\nfine-tuning the system to satisfy specific symmetry constraints. We investigate\nthe response of spin systems that possess such oscillating modes to generic,\nweak perturbations. We show that even when these perturbations break the\nsymmetry and lead to a single steady state, the phase correlations in the\nresulting state exhibit signatures of synchronization. Our results therefore\nconnect the persistent oscillation notion (dynamical) and the notion based on\nphase correlations (steady-state) of synchronization, which so far have been\nregarded as distinct phenomena. Furthermore, we demonstrate that steady-state\nsynchronization in these systems can exhibit features that are absent in the\ndynamical synchronization. Our work suggests robustness of synchronization and\npoints toward a potential unifying framework of quantum synchronization.",
    "authors": [
      "Yi J. Zhao",
      "Joel E. Moore",
      "Juzar Thingna",
      "Christopher W. Wächtler"
    ],
    "categories": [
      "quant-ph",
      "cond-mat.stat-mech"
    ],
    "primary_category": "quant-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.11601v1",
    "entry_id": "http://arxiv.org/abs/2510.11601v1",
    "published": "2025-10-13T16:41:08+00:00",
    "updated": "2025-10-13T16:41:08+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11601v1.pdf"
  },
  {
    "id": "2510.12250v1",
    "title": "Superconductivity in monolayer-trilayer phase of La$_3$Ni$_2$O$_7$ under high pressure",
    "abstract": "The discovery of 80 K superconductivity in pressurized bilayer\nRuddlesden-Popper (RP) nickelate La$_3$Ni$_2$O$_7$ has established a new\nhigh-temperature superconductor family. The quest to understand the governing\nprinciples of RP nickelate superconductivity has become a central focus in\ncondensed matter physics. Here, we report a critical advance by synthesizing\nand investigating a distinct structural polymorph of the same compound: the\nmonolayer-trilayer (1313) hybrid phase of La$_3$Ni$_2$O$_7$. Under high\npressure, synchrotron X-ray diffraction and Raman spectroscopy reveal a\nstructural transition from the orthorhombic $Cmmm$ to the tetragonal $P4/mmm$\nspace group at 13~GPa. Above 19 GPa, the phase exhibits a clear superconducting\ntransition, confirmed by a zero-resistance state, albeit at a significantly\nreduced temperature of 3.6 K. The stark contrast with the 80 K transition in\nthe bilayer phase provides a uniquely clean experimental comparison. Our\nresults demonstrate that the superconducting transition temperature is directly\ngoverned by the nature of the interlayer coupling, and the bilayer NiO$_6$\nblock as the essential structural motif for achieving high-$T_\\text{c}$\nsuperconductivity in the RP nickelates.",
    "authors": [
      "Chaoxin Huang",
      "Jingyuan Li",
      "Xing Huang",
      "Hengyuan Zhang",
      "Deyuan Hu",
      "Mengwu Huo",
      "Xiang Chen",
      "Zhen Chen",
      "Hualei Sun",
      "Meng Wang"
    ],
    "categories": [
      "cond-mat.supr-con"
    ],
    "primary_category": "cond-mat.supr-con",
    "pdf_url": "http://arxiv.org/pdf/2510.12250v1",
    "entry_id": "http://arxiv.org/abs/2510.12250v1",
    "published": "2025-10-14T08:00:11+00:00",
    "updated": "2025-10-14T08:00:11+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12250v1.pdf"
  },
  {
    "id": "2510.11029v1",
    "title": "Frenkel anomaly on co-ordination numbers in liquid CO2 at 100 and 1000 bar studied by Monte Carlo simulation using Kihara potential model",
    "abstract": "An issue concerning the Frenkel line of liquid CO2 is that its location has\nnot been unequivocally determined. So far, reliable Frenkel lines were\nidentified from velocity autocorrelation functions (VAFs) computed by Molecular\nDynamic simulations; however VAFs cannot be directly verified experimentally.\nBy contrast, the co-ordination numbers (CNs) can be measured experimentally by\nX-ray and neutron scattering or computed by Monte Carlo (MC) simulation, and\nthus provide an alternative means of determining the location of the Frenkel\nline. In the present study, the CNs were computed by MC simulation using the\nKihara potential, and the Frenkel anomalies were identified at {P = 100 bar, T\n= 260 K}, in good agreement with previous results based on VAFs, and at {P =\n1000 bar, T = 370 K}, which deviates significantly from them.",
    "authors": [
      "Koji Kobashi"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.11029v1",
    "entry_id": "http://arxiv.org/abs/2510.11029v1",
    "published": "2025-10-13T05:56:19+00:00",
    "updated": "2025-10-13T05:56:19+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11029v1.pdf"
  },
  {
    "id": "2510.10643v1",
    "title": "Non-unitary Time Evolution via the Chebyshev Expansion Method",
    "abstract": "The Chebyshev expansion method is a well-established technique for computing\nthe time evolution of quantum states, particularly in Hermitian systems with a\nbounded spectrum. Here, we show that the applicability of the Chebyshev\nexpansion method extends well beyond this constraint: It remains valid across\nthe entire complex plane and is thus suitable for arbitrary non-Hermitian\nmatrices. We identify that numerical rounding errors are the primary source of\nerrors encountered when applying the method outside the conventional spectral\nbounds, and they are not caused by fundamental limitations. By carefully\nselecting the spectral radius and the time step, we show how these errors can\nbe effectively suppressed, enabling accurate time evolution calculations in\nnon-Hermitian systems. We derive an analytic upper bound for the rounding\nerror, which serves as a practical guideline for selecting time steps in\nnumerical simulations. As an application, we illustrate the performance of the\nmethod by computing the time evolution of wave packets in the Hatano-Nelson\nmodel.",
    "authors": [
      "Áron Holló",
      "Dániel Varjas",
      "Cosma Fulga",
      "László Oroszlány",
      "Viktor Könye"
    ],
    "categories": [
      "cond-mat.mes-hall"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.10643v1",
    "entry_id": "http://arxiv.org/abs/2510.10643v1",
    "published": "2025-10-12T14:56:19+00:00",
    "updated": "2025-10-12T14:56:19+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10643v1.pdf"
  },
  {
    "id": "2510.10610v1",
    "title": "Topology and Martensitic Phase Transformations",
    "abstract": "Triply periodic minimal surfaces (TPMS) are discovered to conform to surfaces\nof given charge density distributions embedded in crystals [Z. Kristallogr.\n\\textbf{170}, 138 (1985)]. Based on our previous work [Phys. Rev. Mater.\n\\textbf{9}, 073802 (2025)], we discovered that crystals can have surfaces of a\ngiven charge density converging to TPMS. We also discovered that end states\nconnected by a martensitic phase transformation should have their corresponding\nTPMS being topologically equivalent. In this work, we gave an explanation for\nthe topological continuity of a martensitic phase transformation and studied\nhow TPMS indicate whether a non-magnetic crystal can undergo a martensitic\nphase transformation or not.",
    "authors": [
      "M. Yin",
      "D. D. Vvedensky"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10610v1",
    "entry_id": "http://arxiv.org/abs/2510.10610v1",
    "published": "2025-10-12T13:46:35+00:00",
    "updated": "2025-10-12T13:46:35+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10610v1.pdf"
  },
  {
    "id": "2510.12731v1",
    "title": "plasmonX: an Open-Source Code for Nanoplasmonics",
    "abstract": "We present the first public release of plasmonX, a novel open-source code for\nsimulating the plasmonic response of complex nanostructures. The code supports\nboth fully atomistic and implicit descriptions of nanomaterials. In particular,\nit employs the frequency-dependent fluctuating charges ($\\omega$FQ) and dipoles\n($\\omega$FQF$\\mu$) models to describe the response properties of atomistic\nstructures, including simple and $d$-metals, graphene-based structures, and\nmulti-metal nanostructures. For implicit representations, the Boundary Element\nMethod is implemented in both the dielectric polarizable continuum model (DPCM)\nand integral equation formalism (IEF-PCM) variants. The distribution also\nincludes a post-processing module that enables analysis of electric\nfield-induced properties such as charge density and electric field patterns.",
    "authors": [
      "Tommaso Giovannini",
      "Pablo Grobas Illobre",
      "Piero Lafiosca",
      "Luca Nicoli",
      "Luca Bonatti",
      "Stefano Corni",
      "Chiara Cappelli"
    ],
    "categories": [
      "cond-mat.mes-hall",
      "physics.comp-ph"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.12731v1",
    "entry_id": "http://arxiv.org/abs/2510.12731v1",
    "published": "2025-10-14T17:10:44+00:00",
    "updated": "2025-10-14T17:10:44+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12731v1.pdf"
  },
  {
    "id": "2510.10521v1",
    "title": "A ferroelectric junction transistor memory made from switchable van der Waals p-n heterojunctions",
    "abstract": "Van der Waals (vdW) p-n heterojunctions are important building blocks for\nadvanced electronics and optoelectronics, in which high-quality heterojunctions\nessentially determine device performances or functionalities. Creating tunable\ndepletion regions with substantially suppressed leakage currents presents huge\nchallenges, but is crucial for heterojunction applications. Here, by using\nband-aligned p-type SnSe and n-type ferroelectric {\\alpha}-In2Se3 as a model,\nwe report near-ideal multifunctional vdW p-n heterojunctions with small reverse\nleakage currents (0.1 pA) and a desired diode ideality factor (1.95).\nAs-fabricated junction transistors exhibit superior performance, such as a high\non/off ratio of over 105. Importantly, we realize ferroelectric-tuned band\nalignment with a giant barrier modulation of 900 meV. Based on such tunable\nheterojunctions, we propose and demonstrate a fundamental different device\ntermed ferroelectric junction field-effect transistor memory, which shows large\nmemory windows (1.8 V), ultrafast speed (100 ns), high operation temperature\n(393 K), and low cycle-to-cycle variation (2 %). Additionally, the reliable\nsynaptic characteristics of these memory devices promise low-power neuromorphic\ncomputing. Our work provides a new device platform with switchable memory\nheterojunctions, applicable to high performance brain-inspired electronics and\noptoelectronics.",
    "authors": [
      "Baoyu Wang",
      "Lingrui Zou",
      "Tao Wang",
      "Lijun Xu",
      "Zexin Dong",
      "Xin He",
      "Shangui Lan",
      "Yinchang Ma",
      "Meng Tang",
      "Maolin Chen",
      "Chen Liu",
      "Zhengdong Luo",
      "Lijie Zhang",
      "Zhenhua Wu",
      "Yan Liu",
      "Genquan Han",
      "Bin Yu",
      "Xixiang Zhang",
      "Fei Xue",
      "Kai Chang"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10521v1",
    "entry_id": "http://arxiv.org/abs/2510.10521v1",
    "published": "2025-10-12T09:44:19+00:00",
    "updated": "2025-10-12T09:44:19+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10521v1.pdf"
  },
  {
    "id": "2510.09921v1",
    "title": "Two-dimensional superconducting diode effect in topological insulator/superconductor heterostructure",
    "abstract": "The superconducting diode effect (SDE) is characterized by the nonreciprocity\nof Cooper-pair motion with respect to current direction. In three-dimensional\n(3D) materials, SDE results in a critical current that varies with direction,\nmaking the effect distinctly observable: the material exhibits\nsuperconductivity in one direction while behaving as a resistive metal in the\nopposite direction. However, in genuinely two-dimensional (2D) materials, the\ncritical current density is theoretically zero, leaving the manifestation of\nSDE in the 2D limit an intriguing challenge. Here, we present the observation\nof SDE in a heterostructure composed of the topological insulator Bi$_2$Te$_3$\nand the iron based superconductor Fe(Se,Te) $-$a candidate for topological\nsuperconductor$-$ where superconductivity is confined to the 2D limit. The\nobserved I-V characteristics reveal nonreciprocity in the vortex-creep regime,\nwhere finite voltages arise due to the two-dimensional nature of\nsuperconductivity. Furthermore, our 2D film demonstrates abrupt voltage jumps,\ninfluenced by both the current flow direction and the transverse magnetic field\ndirection. This behavior resembles that of 3D materials but, in this case, is\ndriven by the vortex-flow instability, as illustrated by voltage controlled\nS-shaped I-V curves. These results underscore the pivotal role of vortex\ndynamics in SDE and provide new insights into the interplay between symmetry\nbreaking and two-dimensionality in topological insulator/superconductor\nsystems.",
    "authors": [
      "Soma Nagahama",
      "Yuki Sato",
      "Minoru Kawamura",
      "Ilya Belopolski",
      "Ryutaro Yoshimi",
      "Atsushi Tsukazaki",
      "Naoya Kanazawa",
      "Kei S Takahashi",
      "Masashi Kawasaki",
      "Yoshinori Tokura"
    ],
    "categories": [
      "cond-mat.supr-con"
    ],
    "primary_category": "cond-mat.supr-con",
    "pdf_url": "http://arxiv.org/pdf/2510.09921v1",
    "entry_id": "http://arxiv.org/abs/2510.09921v1",
    "published": "2025-10-10T23:44:38+00:00",
    "updated": "2025-10-10T23:44:38+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.09921v1.pdf"
  },
  {
    "id": "2510.09933v1",
    "title": "Combined effects of particle geometry and applied vibrations on the mechanics and strength of entangled materials",
    "abstract": "Entangled materials offer attractive structural features including tensile\nstrength and large deformations, combined with infinite assembly and\ndisassembly capabilities. How the geometry of individual particles governs\nentanglement, and in turn translates into macroscopic structural properties,\nprovides a rich landscape in terms of mechanics and offers intriguing\npossibilities in terms of structural design. Despite this potential, there are\nmajor knowledge gaps on the entanglement mechanisms and how they can generate\nstrength. In particular, vibrations are known to have strong effects on\nentanglement and disentanglement but the exact mechanisms underlying these\nobservations are unknown. In this report we present tensile tests and discrete\nelement method (DEM) simulations on bundles of entangled staple-like particles\nthat capture the combined effects of particle geometry and vibrations on local\nentanglement, tensile force chains and strength. We show that standard steel\nstaples with $\\theta = 90^\\circ$ crown-leg angle initially entangle better than\n$\\theta = 20^\\circ$ modified staples because of their more \"open\" geometry.\nHowever, as vibrations are applied entanglement increase faster in $\\theta =\n20^\\circ$ bundles, so that they develop strong and stable tensile force chains,\nproducing bundles which are almost ten times stronger than $\\theta = 90^\\circ$\nbundles. Both tensile strength and entanglement density increase with\nvibrations and also with deformations, up to a steady state value. At that\npoint the rate of entanglement equals the rate of disentanglement, and each of\nthese rates remains relatively high. Finally, we show that vibration can be\nused as a manipulation strategy to either entangle or disentangle staple-like\nentangled granular materials, with confinement playing a significant role in\ndetermining whether vibration promotes entanglement or disentanglement.",
    "authors": [
      "Saeed Pezeshki",
      "Francois Barthelat"
    ],
    "categories": [
      "cond-mat.soft"
    ],
    "primary_category": "cond-mat.soft",
    "pdf_url": "http://arxiv.org/pdf/2510.09933v1",
    "entry_id": "http://arxiv.org/abs/2510.09933v1",
    "published": "2025-10-11T00:15:33+00:00",
    "updated": "2025-10-11T00:15:33+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.09933v1.pdf"
  },
  {
    "id": "2510.10297v1",
    "title": "A continued fraction approximation for the effective elasticity tensor of two-dimensional polycrystals as a function of the crystal elasticity tensor",
    "abstract": "For two-dimensional polycrystals the effective elasticity tensor $C_*$ as a\nfunction $C_*(C_0)$ of the elasticity tensor $C_0$ of the constituent crystal\nis considered. It is shown that this function can be approximated by one with a\ncontinued fraction expansion resembling that associated with a class of\nmicrostructure known as sequential laminates. These are hierarchical\nmicrostructures defined inductively. Rank 0 sequential laminates are simply\nrotations of the pure crystal. Rank $j$ sequential laminates are obtained by\nlaminating together, on a length scale much larger that the existing\nmicrostructure and with interfaces perpendicular to some direction $n_j$, rank\n$j-1$ sequential laminates with a rotation of the pure crystal. The continued\nfraction approximation for arbitrary polycrystal microstructures typically\ntakes a more general form than that of sequential laminates, but has some free\nparameters. It is an open question as to whether these free parameters can\nalways be adjusted so the continued fraction approximation matches exactly that\nof a sequential laminate. If so, one would have established that the elastic\nresponse of two-dimensional polycrystals can always be mimicked by that of\nsequential laminates. Our analysis carries over to the more general case where\nthe strain is replaced by a field $E(x)$ that is the gradient of a vector\npotential $u(x)$, i.e. $E=\\nabla u$ and the stress is replaced by a matrix\nvalued field $J(x)$ that need not be symmetric but has zero divergence\n$\\nabla\\cdot J=0$. The tensor $L(x)$ entering the constitutive relation $J=L E$\nis locally a rotation of the tensor $L_0$ of the pure crystal that need not\nhave any special symmetries and has 16 independent tensor elements.",
    "authors": [
      "Graeme W. Milton"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "math-ph",
      "math.AP",
      "math.MP"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10297v1",
    "entry_id": "http://arxiv.org/abs/2510.10297v1",
    "published": "2025-10-11T17:38:42+00:00",
    "updated": "2025-10-11T17:38:42+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10297v1.pdf"
  },
  {
    "id": "2510.12737v1",
    "title": "Time-dependent Variational Principles for Hybrid Non-Unitary Dynamics: Application to Driven-Dissipative Superconductors",
    "abstract": "We introduce time-dependent variational principles to study the non-unitary\ndynamics of open quantum many-body systems, including dynamics described by the\nfull Lindblad master equation, the non-Hermitian dynamics corresponding to the\nno-click limit of the fully post-selected quantum trajectories, and the\ndynamics described by a hybrid Lindbladian with a control parameter $\\alpha$\nwhich interpolates between the full post-selection and averaging over all\nquantum trajectories. As an application we study the non-unitary dynamics of a\nlossy or driven-dissipative BCS superconductors, evolving in presence of\ntwo-body losses and two-body pumps. We show that the non-Hermitian limit acts\nas a singular limit of the hybrid dissipative dynamics, leading to a sharp\nmodification of the universal approach to the driven-dissipative steady-states.\nBy considering the dissipative dynamics with pair losses, we show that, as the\nnon-Hermitian limit is approached, the density dynamics sharply evolves from a\nuniversal power-law to exponential decay that converges towards a quasi-steady\nplateau characterized by the freezing of the particle depletion due to pair\nlosses. The reached quasi-stationary density increases as a function of the\ndissipation rate highlighting the emergence of a non-Hermitian Zeno effect in\nthe lossy dynamics. For the driven-dissipative case, we show that, in the\nnon-Hermitian limit, the system gets trapped into an effective negative\ntemperature state, thus skipping the infinite temperature steady-state reached\nin the presence of finite contribution of the quantum jumps. We rationalize\nthese findings in terms of the conservation of the length of the pseudospins\nwhich, in the non-Hermitian limit, suppresses the effective single-particle\nlosses and pumps acting on the non-condensed particles.",
    "authors": [
      "Pasquale Filice",
      "Marco Schirò",
      "Giacomo Mazza"
    ],
    "categories": [
      "quant-ph",
      "cond-mat.quant-gas",
      "cond-mat.str-el",
      "cond-mat.supr-con"
    ],
    "primary_category": "quant-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.12737v1",
    "entry_id": "http://arxiv.org/abs/2510.12737v1",
    "published": "2025-10-14T17:13:29+00:00",
    "updated": "2025-10-14T17:13:29+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12737v1.pdf"
  },
  {
    "id": "2510.11088v1",
    "title": "Local-Antisymmetric Flat Band and Coexisting Correlated stripe charge orders in WSe2-Modulated Twisted Bilayer Graphene",
    "abstract": "Insulating, atomically flat transition metal dichalcogenides (TMDs) like WSe2\nare ideal substrates for probing intrinsic graphene properties. Conventionally,\ntheir influence on graphene's band structure is assumed negligible,\nparticularly when small moire patterns form. Combining scanning tunneling\nmicroscopy/spectroscopy and theoretical analysis, we reveal that the atomic\nregistry in graphene/WSe2 heterostructures profoundly modulates the electronic\nstructure of magic-angle twisted bilayer graphene (MATBG). At special\ngraphene/WSe2 twist angles, an incommensurate moire superlattice hosts three\ndistinct atomic stacking configurations (A, B, X types). These induce\nposition-dependent potentials that asymmetrically shift MATBG's flat bands,\ntransforming them from hole-side to electron-side asymmetric within a single\nAA-stacked region. This symmetry breaking enables the unprecedented coexistence\nof orthogonal stripe charge orders in the correlated regime-a phenomenon\npreviously considered mutually exclusive due to Coulomb repulsion. This band\nmodulation arises from the synergistic effects of the graphene/WSe2 interfacial\natomic registry and heterostrain within the MATBG, exhibiting multi-field\ntunability. Our work establishes interfacial atomic registry as a critical,\npreviously overlooked tuning parameter for flat-band physics, opening avenues\nto engineer correlated quantum states in van der Waals heterostructures.",
    "authors": [
      "Chi Zhang",
      "Shihao Zhang",
      "Mengmeng Zhang",
      "Lin He",
      "Qi Zheng"
    ],
    "categories": [
      "cond-mat.mes-hall",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.11088v1",
    "entry_id": "http://arxiv.org/abs/2510.11088v1",
    "published": "2025-10-13T07:32:09+00:00",
    "updated": "2025-10-13T07:32:09+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11088v1.pdf"
  },
  {
    "id": "2510.11981v1",
    "title": "Open Quantum Dynamics Theory for Coulomb Potentials: Hierarchical Equations of Motion for Atomic Orbitals (AO-HEOM)",
    "abstract": "We investigate the quantum dynamics of Coulomb potential systems in thermal\nbaths. We study these systems within the framework of open quantum dynamics\ntheory, focusing on preserving the rotational symmetry of the entire system,\nincluding the baths. Thus, we employ a three-dimensional rotationally invariant\nsystem-bath (3D-RISB) model to derive numerically ``exact'' hierarchical\nequations of motion for atomic orbitals (AO-HEOM) that enable a\nnon-perturbative and non-Markovian treatment of system-bath interactions at\nfinite temperatures. To assess the formalism, we calculated the linear\nabsorption spectrum of an atomic system under isotropic thermal environment,\nwith systematic variation of system-bath coupling strength and temperature.",
    "authors": [
      "Yankai Zhang",
      "oshitaka Tanimura"
    ],
    "categories": [
      "quant-ph",
      "cond-mat.stat-mech",
      "physics.chem-ph"
    ],
    "primary_category": "quant-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.11981v1",
    "entry_id": "http://arxiv.org/abs/2510.11981v1",
    "published": "2025-10-13T22:26:38+00:00",
    "updated": "2025-10-13T22:26:38+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11981v1.pdf"
  },
  {
    "id": "2510.11159v1",
    "title": "Tunable multi-photon correlations from a coherently driven quantum dot",
    "abstract": "Mixing the fields generated by different light sources has emerged as a\npowerful approach for engineering non-Gaussian quantum states. Understanding\nand controlling the resulting photon statistics is useful for emerging quantum\ntechnologies that are underpinned by interference. In this work, we investigate\nintensity correlation functions arising from the interference of resonance\nfluorescence from a quantum emitter with a coherent laser field. We show that\nthe observed bunching behavior results from a subtle interplay between quantum\ninterference and the normalization of the correlation functions. We show that\nby adjusting the mixing ratio and phase one can achieve full tunability of the\nsecond-order correlation, ranging from anti-bunching to bunching. We further\nextend our analysis to third-order correlation functions, both experimentally\nand theoretically, to provide new insights into the interpretation of\nhigher-order correlations and offer practical tools for shaping quantum optical\nfields.",
    "authors": [
      "Thomas K. Bracht",
      "Rachel N. Clark",
      "Petros Androvitsaneas",
      "Matthew Jordan",
      "Samuel G. Bishop",
      "Harry E. Dyte",
      "Moritz Cygorek",
      "Ian A. Farrer",
      "Doris E. Reiter",
      "Anthony J. Bennett"
    ],
    "categories": [
      "quant-ph",
      "cond-mat.mes-hall"
    ],
    "primary_category": "quant-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.11159v1",
    "entry_id": "http://arxiv.org/abs/2510.11159v1",
    "published": "2025-10-13T08:51:01+00:00",
    "updated": "2025-10-13T08:51:01+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11159v1.pdf"
  },
  {
    "id": "2510.10525v1",
    "title": "Time domain braiding of anyons revealed through a nonequilibrium fluctuation dissipation theorem",
    "abstract": "We derive a novel fluctuation--dissipation theorem (FDT) valid for\nnonequilibrium initial states that imprint the braiding of anyons in the time\ndomain. The derivation is carried out within the Unifying Nonequilibrium\nPerturbative Theory (UNEPT), which applies to both standard reservoir\ngeometries and configurations with one or two quantum point contacts (QPCs)\ninjecting dilute anyonic fluxes. Based on this FDT, we propose complementary\nmethods to determine the time-domain braiding phase. The first method relates\nthe DC backscattering noise to the integral of the current with respect to DC\ndrives, while the second connects the AC current phase shift to the DC noise.\nThe latter provides a particularly robust probe of the statistical angle\n$\\theta$, offering an intrinsic calibration and cancelling certain nonuniversal\nrenormalization effects. Specializing to a thermalized Tomonaga--Luttinger\nliquid (TLL), we further show that in the quantum regime the phase shift\nenables a direct determination of the scaling dimension $\\delta$ when $\\delta >\n1/2$. These results define experimentally accessible schemes to extract either\n$\\theta$ or $\\delta$ in minimal single-QPC setups, without relying on\ninterferometry or cross-correlation measurements.",
    "authors": [
      "Ines Safi"
    ],
    "categories": [
      "cond-mat.mes-hall",
      "cond-mat.str-el",
      "quant-ph"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.10525v1",
    "entry_id": "http://arxiv.org/abs/2510.10525v1",
    "published": "2025-10-12T09:48:32+00:00",
    "updated": "2025-10-12T09:48:32+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10525v1.pdf"
  },
  {
    "id": "2510.11607v1",
    "title": "Flux confinement-deconfinement transition of dimer-loop models on three-dimensional bipartite lattices",
    "abstract": "Motivated by recent work that mapped the low-temperature properties of a\nclass of frustrated spin $S=1$ kagome antiferromagnets with competing exchange\nand single-ion anisotropies to the fully-packed limit (with each vertex touched\nby exactly one dimer or nontrivial loop) of a system of dimers and nontrivial\n(length $s > 2$) loops on the honeycomb lattice, we study this fully-packed\ndimer-loop model on the three-dimensional bipartite cubic and diamond lattices\nas a function of $w$, the relative fugacity of dimers. We find that the $w\n\\rightarrow 0$ O($1$) loop-model limit is separated from the $w \\rightarrow\n\\infty$ dimer limit by a geometric phase transition at a nonzero finite\ncritical fugacity $w_c$: The $w>w_c$ phase has short loops with an\nexponentially decaying loop-size distribution, while the $w<w_c$ phase is\ndominated by large loops whose loop-size distribution is governed by universal\nproperties of the critical O($1$) loop soup. This transition separates two {\\em\ndistinct} Coulomb liquid phases of the system: Both phases admit a description\nin terms of a fluctuating divergence-free polarization field\n$P_{\\mu}(\\mathbf{r})$ on links of the lattice and are characterized by dipolar\ncorrelations at long distances. The transition at $w_c$ is a flux\nconfinement-deconfinement transition. Equivalently, and independent of boundary\nconditions, half-integer test charges $q=\\pm 1/2$ are confined for $w>w_c$, but\nbecome deconfined in the small-$w$ phase. Although both phases are unstable to\na nonzero fugacity for the charge $\\pm 1/2$ excitations, the destruction of the\n$w >w_c$ Coulomb liquid is characterized by an interesting slow crossover,\nsince test charges with $q=\\pm 1/2$ are confined in this phase.",
    "authors": [
      "Souvik Kundu",
      "Kedar Damle"
    ],
    "categories": [
      "cond-mat.stat-mech"
    ],
    "primary_category": "cond-mat.stat-mech",
    "pdf_url": "http://arxiv.org/pdf/2510.11607v1",
    "entry_id": "http://arxiv.org/abs/2510.11607v1",
    "published": "2025-10-13T16:46:25+00:00",
    "updated": "2025-10-13T16:46:25+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11607v1.pdf"
  },
  {
    "id": "2510.12055v1",
    "title": "Quantification of Electrolyte Degradation in Lithium-ion Batteries with Neutron Imaging Techniques",
    "abstract": "Non-destructive characterization of lithium-ion batteries provides critical\ninsights for optimizing performance and lifespan while preserving structural\nintegrity. Optimizing electrolyte design in commercial LIBs requires\nconsideration of composition, electrolyte-to-capacity ratio, spatial\ndistribution, and associated degradation pathways. However, existing\nnon-destructive methods for studying electrolyte infiltration, distribution,\nand degradation in LIBs lack the spatiotemporal resolution required for precise\nobservation and quantification of the electrolyte. In this study, we employ\nneutron imaging with sufficient spatial resolution ~150 um and large field of\nview 20x20 cm2 to quantitatively resolve the electrolyte inventory and\ndistribution within LiFePO4/graphite pouch cells under high-temperature\naccelerated aging. Quantitative standard curves based on neutron transmission\nattenuation reveal a clear electrolyte dry-out threshold at 3.18 g Ah-1 and the\ntwo stages evolutions of EI during cell aging were quantified. By integrating\nnon-destructive electrochemical diagnostics, accelerated graphite material loss\nand liquid phase Li+ diffusion degradation is observed during pore-drying.\nFurther analysis, including operando cyclic aging, reveals that the neutron\ntransmission below the saturation reference is due to the enrichment of\nhydrogen nuclei within the solid-electrolyte interphase. Assumed pore-drying\ndoes not occur, the SEI signal of the electrodes can be quantitatively\ndecoupled during ageing. Combined analyses with NI, TOF-SIMS, and SEM reveal\nthat high EI cells exhibit uniform SEI growth and reduced degradation, while\nlow EI cells show uneven SEI formation, accelerating capacity loss. This study\nunveils a dynamic electrolyte infiltration-consumption-dry-out process in LIBs,\noffering non-destructive and quantitative insights to guide sustainable and\ndurable battery development.",
    "authors": [
      "Yonggang Hu",
      "Yiqing Liao",
      "Lufeng Yang",
      "Ke Zhang",
      "Yufan Peng",
      "Shijun Tang",
      "Shengxiang Wang",
      "Meifang Ding",
      "Jiahao Wu",
      "Jianrong Lin",
      "Jinding Liang",
      "Yimin Wei",
      "Yanting Jin",
      "Zhengliang Gong",
      "Anatoliy Senyshyn",
      "Jie Chen",
      "Yong Yang"
    ],
    "categories": [
      "physics.app-ph",
      "cond-mat.mtrl-sci",
      "hep-ex"
    ],
    "primary_category": "physics.app-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.12055v1",
    "entry_id": "http://arxiv.org/abs/2510.12055v1",
    "published": "2025-10-14T01:51:00+00:00",
    "updated": "2025-10-14T01:51:00+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12055v1.pdf"
  },
  {
    "id": "2510.12473v1",
    "title": "Two-Dimensional Na2LiAlP2 crystal for high-performance field-effect transistors",
    "abstract": "High-performance, low-power transistors are core components of advanced\nintegrated circuits, and the ultimate limitation of Moore's law has made the\nsearch for new alternative pathways an urgent priority. Two-dimensional (2D)\nmaterials have become the most promising exploration target due to their\nexceptional electronic properties and scalability. In this work, we conducted\ndevice transport research on the previously proposed 2D quaternary\nsemiconductor Na2LiAlP2 using the non-equilibrium Green's function method. The\nresults demonstrate that even with a channel length of 5.7 nm, Na2LiAlP2 still\nexhibits excellent n-type transistor characteristics, fully meeting and\nsurpassing the technical specifications outlined in the International Roadmap\nfor Devices and Systems (IRDS). Encouragingly, the device can easily achieve\nthe required on-state current of 900 {\\mu}A/{\\mu}m under low operating voltages\nof 0.1 V and 0.2 V. Moreover, at 0.1 V operating voltage, the device's\nsubthreshold swing breaks through the theoretical limit of 60 mV/dec, reaching\nan astonishing value 30.33 mV/dec. Additionally, its p-type transistor\nperformance also stands out with a subthreshold swing of ~50 mV/dec when the\nchannel length is 7.9 nm. Our research not only showcases the exceptional\ntransistor properties of Na2LiAlP2 but also further expands the research scope\nof 2D high-performance transistors.",
    "authors": [
      "Run-Jie Peng",
      "Xing-Yu Wang",
      "Jun-Hui Yuan",
      "Nian-Nian Yu",
      "Kan-Hao Xue",
      "Jiafu Wang",
      "Pan Zhang"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.12473v1",
    "entry_id": "http://arxiv.org/abs/2510.12473v1",
    "published": "2025-10-14T13:04:09+00:00",
    "updated": "2025-10-14T13:04:09+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12473v1.pdf"
  },
  {
    "id": "2510.12613v1",
    "title": "Quantum Spin Singlet and Classical Néel-Ordered Ground States in MoX3 (X = I, Br) Spin-3/2 Dimerized Antiferromagnetic Chain Crystals",
    "abstract": "We report that MoX3 (X = I, Br) are rare van der Waals materials that exhibit\nsignatures of both quantum spin chains with a spin singlet ground state and\nclassical Neel order. Bulk single crystals grown by chemical vapor transport\nexhibit classical antiferromagnetic ground states with a transition temperature\nof ~40 K as revealed by susceptibility and specific heat measurements. Above 40\nK, the susceptibilities show the large, broad peaks associated with a quantum\nspin-singlet ground state and large singlet-triplet gaps of 21 meV and 25 meV.\nMonte Carlo simulations, density matrix renormalization-group calculations for\nfinite spin-3/2 chains, and density functional theory reproduce the\nexperimental behavior, confirming the interplay between strong one-dimensional\nintrachain and weak three-dimensional interchain couplings. MoX3 offers a\nunique platform for exploring quantum magnetism and magnetic excitations at the\natomic chain limit, as these materials combine a 1D van der Waals motif, spin\nchain behavior, and classical interchain order.",
    "authors": [
      "Jordan Teeter",
      "Topojit Debnath",
      "Harshil Goyal",
      "Md Sabbir Hossen Bijoy",
      "Maedeh Taheri",
      "Nicholas Sesing",
      "Fariborz Kargar",
      "Kirill Shtengel",
      "Tina Salguero",
      "Roger K. Lake",
      "Alexander A. Balandin"
    ],
    "categories": [
      "cond-mat.str-el",
      "cond-mat.mes-hall"
    ],
    "primary_category": "cond-mat.str-el",
    "pdf_url": "http://arxiv.org/pdf/2510.12613v1",
    "entry_id": "http://arxiv.org/abs/2510.12613v1",
    "published": "2025-10-14T15:12:33+00:00",
    "updated": "2025-10-14T15:12:33+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12613v1.pdf"
  },
  {
    "id": "2510.12614v1",
    "title": "Modeling Epidemics on Multiplex Networks: Epidemic Threshold and Basic Reproduction Number",
    "abstract": "Accurate epidemic forecasting requires models that account for the layered\nand heterogeneous nature of real social interactions. The basic reproduction\nnumber $\\mathcal R_0$ calculated from models that assume homogeneous mixing or\nsingle-layer contact structures have limited applicability to complex social\nsystems. Here, we propose an expression of $\\mathcal R_0$ in the context of\nmultiplex networks, enabling the analysis of disease transmission across\nmultiple social layers.\n  We adapt the Degree-Based Mean-Field (DBMF) SIR model for single-layered\ncomplex networks to the multiplex setting, where each layer has its own degree\ndistribution and infection rate. Using the Next Generation Matrix method, we\nderive an analytical expression for the basic reproduction number $\\mathcal\nR_0$. Numerical integration of the multiplex DBMF equations shows that\n$\\mathcal R_0 = 1$ marks the epidemic threshold and governs the functional\ndependence of key outbreak indicators. In addition to the exact result for the\n$\\mathcal R_0$, we provide an approximation denoted as $\\tau$, which is easier\nto compute and more straightforward to interpret in terms of the parameters of\nthe system, and shares most of the expected properties of the basic\nreproduction number.\n  Stochastic agent-based simulations confirm these results, demonstrating a\ndirect correspondence between $\\tau$ and the average number of secondary\ninfections in the early epidemic phase, in line with the interpretation of\n$\\mathcal R_0$.\n  This research provides a robust generalization of $\\mathcal R_0$ for layered\ncontact structures, offering a more realistic basis for epidemic forecasting\nand the design of intervention strategies.",
    "authors": [
      "Eric Alejandro Rozan",
      "Mario Ignacio Simoy",
      "Sebastian Bouzat",
      "Marcelo Nestor Kuperman"
    ],
    "categories": [
      "physics.soc-ph",
      "cond-mat.stat-mech",
      "nlin.AO",
      "q-bio.PE"
    ],
    "primary_category": "physics.soc-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.12614v1",
    "entry_id": "http://arxiv.org/abs/2510.12614v1",
    "published": "2025-10-14T15:14:12+00:00",
    "updated": "2025-10-14T15:14:12+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12614v1.pdf"
  },
  {
    "id": "2510.10405v1",
    "title": "Electric Polarization-Driven Modulation of Fe Adatoms on Ferroelectric $α$-In$_2$Se$_3$",
    "abstract": "The interplay among structural, electronic, and magnetic properties of Fe\nadatoms on the surface of two-dimensional ferroelectric {\\alpha}-In$_2$Se$_3$\nis investigated using first-principles electronic structure calculations, with\na focus on how these properties are modulated by the direction of the electric\npolarization of the substrate. We identify two competing adsorption sites for\nFe adatoms, whose relative stability depends on the adatom concentration and\ncan be reversed by switching the electric polarization of\n{\\alpha}-In$_2$Se$_3$. The calculated energy barrier for thermally activated\nhopping between these sites is approximately 0.4 eV, corresponding to a\nblocking temperature of around 100 K. The hybridization between Fe and\nIn$_2$Se$_3$ orbitals strongly depends on the adsorption site and polarization\ndirection, driven by variations in the local adatom geometry. As a result, the\nelectronic configuration of adatom, magnetic moment, and magnetic anisotropy\nexhibit a pronounced site dependence and can be effectively modulated by\nswitching the electric polarization of the In$_2$Se$_3$ layer. In particular,\nat higher adatom concentrations, an exceptionally large perpendicular magnetic\nanisotropy, exceeding 200 meV per Fe atom, emerges for one polarization\ndirection, but is largely diminished when the polarization is reversed. These\nfindings indicate that ferroelectric substrates offer a promising route for\nvoltage-controlled tuning of magnetic adatom properties via reversible\npolarization switching.",
    "authors": [
      "Monirul Shaikh",
      "Aleksander L. Wysocki"
    ],
    "categories": [
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.10405v1",
    "entry_id": "http://arxiv.org/abs/2510.10405v1",
    "published": "2025-10-12T01:48:32+00:00",
    "updated": "2025-10-12T01:48:32+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10405v1.pdf"
  },
  {
    "id": "2510.12492v1",
    "title": "Hydrodynamic Ratchet for Tracer Transport in a Soft Microchannel: A Detailed Analysis",
    "abstract": "Understanding surface-driven transport is of paramount importance from the\nperspective of biological applications and the synthesis of microfluidic\ndevices. In this work, we develop an analysis of a local inversion symmetry\nbroken fluid flow model through an undulating microchannel. Surface undulations\nof a few tens of Hertz in a soft microchannel keep the fluid flow in a low\nReynolds number regime, allowing the advantage of a perturbation analysis of\nfluid flow. Using this, we develop a detailed analysis of the relationship\nbetween the fluid velocity and surface undulations, which is crucial for the\nsubsequent numerical analysis of tracer motion. We used this information to\nstudy the dynamics of a tracer particle in the velocity field of an undulating\nmicrochannel. We show that the tracer particle can undergo ratcheting (which we\ncall the hydrodynamics ratchet effect) in very specific, physically meaningful\ncircumstances. We observe a ratcheting velocity of $\\sim 0.15 \\;\\mu$m/sec for a\nmicrometre-sized particle at room temperature in water when the undulations\nwavelength is of the order of 1 $\\mu$m.",
    "authors": [
      "Aakash Anand",
      "A. Bhattacharyay"
    ],
    "categories": [
      "physics.flu-dyn",
      "cond-mat.stat-mech"
    ],
    "primary_category": "physics.flu-dyn",
    "pdf_url": "http://arxiv.org/pdf/2510.12492v1",
    "entry_id": "http://arxiv.org/abs/2510.12492v1",
    "published": "2025-10-14T13:25:59+00:00",
    "updated": "2025-10-14T13:25:59+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12492v1.pdf"
  },
  {
    "id": "2510.10094v1",
    "title": "The effect of magnetic fields on vertex reconstructed muon-spin spectroscopy",
    "abstract": "The use of a Si pixel-based particle tracking scheme in muSR will, among\nothers, allow measurements using a ten-fold increased stopped muons rate and\nsamples ten times smaller than currently possible. Here we present simulation\nresults to assess the effects of magnetic fields on two spectrometer\nconfigurations using a two-layered tracking scheme for the incoming and\noutgoing particles. At a low magnetic field of up to ~50 mT, the tracking and\nreconstruction accuracy is only minimally influenced. Beyond a magnetic field\nof ~80 mT the tracking capabilities diminish significantly. Operating a\ntwo-layered scheme using small magnetic fields hence does not require\nadaptations. Only at large magnetic fields, a tracking scheme that makes use of\nan accurate field map or the use of at least three layers must be employed to\nachieve reliable particle tracking.",
    "authors": [
      "Pascal Isenring",
      "Zaher Salman"
    ],
    "categories": [
      "physics.ins-det",
      "cond-mat.mtrl-sci"
    ],
    "primary_category": "physics.ins-det",
    "pdf_url": "http://arxiv.org/pdf/2510.10094v1",
    "entry_id": "http://arxiv.org/abs/2510.10094v1",
    "published": "2025-10-11T08:09:12+00:00",
    "updated": "2025-10-11T08:09:12+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10094v1.pdf"
  },
  {
    "id": "2510.11350v1",
    "title": "Electron-phonon coupling in magnetic materials using the local spin density approximation",
    "abstract": "Magnetic materials are crucial for manipulating electron spin and magnetic\nfields, enabling applications in data storage, spintronics, charge transport,\nand energy conversion, while also providing insight into fundamental quantum\nphenomena. In numerous applications, the interaction between electrons and\nlattice vibrations, known as electron-phonon coupling, can be of significant\nimportance. In that regard, we extend the EPW package to be able to interpolate\nthe electron-phonon matrix elements combining perturbation theory and maximally\nlocalized Wannier functions. This allows to use dense momentum grids at a\nreasonable computational cost when computing electron-phonon-related quantities\nand physical properties. We validate our implementation considering\nferromagnetic iron and nickel, where we explore the absence of phonon-driven\nsuperconductivity, finding that superconductivity is intrinsically suppressed.\nFurthermore, we evaluate the carrier resistivity at finite temperatures for\nboth systems, considering the role of the magnetic phase in carrier transport.\nOur findings indicate that in the case of Fe, the primary contributor to\nresistivity is electron-phonon scattering. In contrast, for Ni, electron-phonon\nscattering constitutes less than one-third of the resistivity, underscoring a\nfundamental difference in the transport properties of the two systems.",
    "authors": [
      "Á. A. Carrasco Álvarez",
      "M. Giantomassi",
      "J. Lihm",
      "G. E. Allemand",
      "M. Mignolet",
      "M. Verstraete",
      "S. Poncé"
    ],
    "categories": [
      "cond-mat.mtrl-sci",
      "physics.comp-ph"
    ],
    "primary_category": "cond-mat.mtrl-sci",
    "pdf_url": "http://arxiv.org/pdf/2510.11350v1",
    "entry_id": "http://arxiv.org/abs/2510.11350v1",
    "published": "2025-10-13T12:45:25+00:00",
    "updated": "2025-10-13T12:45:25+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11350v1.pdf"
  },
  {
    "id": "2510.12696v1",
    "title": "Temperature and conditions for thermalization after canonical quenches",
    "abstract": "We consider quenches of a quantum system that is prepared in a canonical\nequilibrium state of one Hamiltonian and then evolves unitarily in time under a\ndifferent Hamiltonian. Technically, our main result is a systematic expansion\nof the pre- and post-quench canonical ensembles in the quench strength. We\nfirst demonstrate how this can be used to predict the system's temperature\nafter the quench from equilibrium properties at the pre-quench temperature. For\na thermalizing post-quench system, it furthermore allows us to calculate\nequilibrium observable expectation values. Finally, in the presence of\nadditional conserved quantities besides the Hamiltonian, we obtain a hierarchy\nof necessary conditions for thermalization towards the (post-quench) canonical\nensemble. At first order, these thermalization conditions have a nice geometric\ninterpretation in operator space with the canonical covariance as a semi-inner\nproduct: The quench operator (difference between post- and pre-quench\nHamiltonians) and the conserved quantity must be orthogonal in the orthogonal\ncomplement of the post-quench Hamiltonian. We illustrate the results\nnumerically for a variety of setups involving integrable and nonintegrable\nmodels.",
    "authors": [
      "Lennart Dabelow"
    ],
    "categories": [
      "cond-mat.stat-mech",
      "quant-ph"
    ],
    "primary_category": "cond-mat.stat-mech",
    "pdf_url": "http://arxiv.org/pdf/2510.12696v1",
    "entry_id": "http://arxiv.org/abs/2510.12696v1",
    "published": "2025-10-14T16:29:16+00:00",
    "updated": "2025-10-14T16:29:16+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.12696v1.pdf"
  },
  {
    "id": "2510.10266v1",
    "title": "Harvesting chemical power from cyclic environments",
    "abstract": "Life relies on a sophisticated metabolic molecular machinery that turns over\nhigh-energy molecules to evolve complex macromolecules and assemblies. At the\nmolecular origin of life, such machinery was absent, implying the need for\nsimple yet robust physical mechanisms to harvest energy from the environment\nand perform chemical work or produce chemical power. However, the mechanisms\ninvolved in harvesting energy from a macroscopic cyclic environment to drive\nchemical processes on the molecular scale remain elusive. In this work, we\npropose a theory that describes the kinetics of chemical reactions in a system\nsubject to a cyclic reservoir with varying properties. We compare cycles of\nsolvent (wet-dry cycles), with cycles of a component participating in a\nchemical reaction (reactant cycle). We find that for both wet-dry and reactant\ncycles, resonance frequencies exist at which the chemical power is maximal. We\nidentify which cycle type is more beneficial in harvesting chemical power for\ndifferent molecular interactions. Our findings of harvest efficiencies around\nten percent suggest that the cyclic environment could have played a key role in\ncatalyzing the metabolic molecular machinery at the molecular origin of life.",
    "authors": [
      "Pranay Jaiswal",
      "Ivar S. Haugerud",
      "Hidde D. Vuijk",
      "Christoph A. Weber"
    ],
    "categories": [
      "physics.chem-ph",
      "cond-mat.soft"
    ],
    "primary_category": "physics.chem-ph",
    "pdf_url": "http://arxiv.org/pdf/2510.10266v1",
    "entry_id": "http://arxiv.org/abs/2510.10266v1",
    "published": "2025-10-11T15:51:44+00:00",
    "updated": "2025-10-11T15:51:44+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.10266v1.pdf"
  },
  {
    "id": "2510.11860v1",
    "title": "Topological Robustness of Anyon Tunneling at $ν= 1/3$",
    "abstract": "The scaling exponent $g$ of the quasiparticle propagator for incompressible\nfractional quantum Hall states in the Laughlin sequence is expected to be\nrobust against perturbations that do not close the gap. Here we probe the\ntopological robustness of the chiral Luttinger liquid at the boundary of the\n$\\nu=1/3$ state by measuring the tunneling conductance between\ncounterpropagating edge modes as a function of quantum point contact\ntransmission. We demonstrate that for transmission $t\\geq 0.7$ the tunneling\nconductance is well-described by the first two terms of a perturbative series\nexpansion corresponding to $g=1/3$. We further demonstrate that the measured\nscaling exponent is robustly pinned to $g=1/3$ across the plateau, only\ndeviating as the bulk state becomes compressible. Finally we examine the impact\nof weak disorder on the scaling exponent, finding it insensitive. These\nmeasurements firmly establish the topological robustness of anyon tunneling at\n$\\nu=1/3$ and substantiate the chiral Luttinger liquid description of the edge\nmode.",
    "authors": [
      "Adithya Suresh",
      "Ramon Guerrero-Suarez",
      "Tanmay Maiti",
      "Shuang Liang",
      "Geoffrey Gardner",
      "Claudio Chamon",
      "Michael Manfra"
    ],
    "categories": [
      "cond-mat.mes-hall",
      "cond-mat.str-el"
    ],
    "primary_category": "cond-mat.mes-hall",
    "pdf_url": "http://arxiv.org/pdf/2510.11860v1",
    "entry_id": "http://arxiv.org/abs/2510.11860v1",
    "published": "2025-10-13T19:13:43+00:00",
    "updated": "2025-10-13T19:13:43+00:00",
    "source": "arxiv",
    "arxiv_category": "cond-mat",
    "time_window": {
      "start": "2024-10-15T00:00:00+00:00",
      "end": "2025-10-15T15:39:40.822918+00:00"
    },
    "local_pdf_path": "data/arxiv/cond-mat/pdfs/2510.11860v1.pdf"
  }
]